name: Windows Event Log System 4720
id: f01d4758-05c8-4ac4-a9a5-33500dd5eb6c
version: 3
date: '2025-07-10'
author: Patrick Bareiss, Splunk
description: Logs the creation of a new user account, including details about 
  the account name, associated domain, and the account performing the action.
mitre_components:
- User Account Creation
- User Account Metadata
- Active Directory Object Creation
- Application Log Content
source: XmlWinEventLog:System
sourcetype: XmlWinEventLog
separator: EventCode
separator_value: '4720'
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 9.0.1
fields:
- _time
- Account_Domain
- Account_Expires
- Account_Name
- Allowed_To_Delegate_To
- CategoryString
- ComputerName
- Display_Name
- Error_Code
- EventCode
- EventType
- Home_Directory
- Home_Drive
- Keywords
- LogName
- Logon_Hours
- Logon_ID
- MSADChangedAttributes
- Message
- New_UAC_Value
- Old_UAC_Value
- OpCode
- Password_Last_Set
- Primary_Group_ID
- Profile_Path
- RecordNumber
- SAM_Account_Name
- SID_History
- Script_Path
- Security_ID
- SourceName
- Subject_Account_Domain
- Subject_Account_Name
- Subject_Logon_ID
- Subject_Security_ID
- TaskCategory
- Type
- User_Parameters
- User_Principal_Name
- User_Workstations
- action
- app
- body
- category
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dest_nt_host
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- member_dn
- member_id
- member_nt_domain
- msad_action
- name
- object_category
- product
- punct
- result
- session_id
- severity
- severity_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group_id
- vendor
- vendor_product
output_fields:
- dest
example_log: 10/09/2020 10:41:26 AM
