name: Windows Event Log Security 4699
id: 4727dead-d063-4333-9ddd-59823a416aff
version: 3
date: '2025-07-10'
author: Patrick Bareiss, Splunk
description: Logs an event when a scheduled task is deleted from the system.
mitre_components:
- Scheduled Job Metadata
- Scheduled Job Modification
source: XmlWinEventLog:Security
sourcetype: XmlWinEventLog
separator: EventCode
separator_value: '4699'
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 9.0.1
fields:
- _time
- Account_Domain
- Account_Name
- ComputerName
- Error_Code
- EventCode
- EventType
- Keywords
- LogName
- Logon_ID
- Message
- OpCode
- RecordNumber
- Security_ID
- SourceName
- Subject_Account_Domain
- Subject_Account_Name
- Subject_Logon_ID
- Subject_Security_ID
- TaskCategory
- Task_Name
- Type
- action
- app
- body
- category
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dest_nt_host
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- member_dn
- member_id
- member_nt_domain
- name
- product
- punct
- session_id
- severity
- severity_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- status
- subject
- ta_windows_action
- tag
- tag::action
- tag::eventtype
- timeendpos
- timestartpos
- user
- vendor
- vendor_product
output_fields:
- dest
example_log: 11/12/2021 05:16:44 PM
