name: Active Directory Privilege Escalation Identified
id: 583e8a68-f2f7-45be-8fc9-bf725f0e22fd
version: 6
date: '2025-05-02'
author: Mauricio Velazco, Splunk
status: production
type: Correlation
data_source: []
description: The following analytic identifies potential privilege escalation activities
  within an organization's Active Directory (AD) environment. It detects this activity
  by correlating multiple analytics from the Active Directory Privilege Escalation
  analytic story within a specified time frame. This is significant for a SOC as it
  helps identify coordinated attempts to gain elevated privileges, which could indicate
  a serious security threat. If confirmed malicious, this activity could allow attackers
  to gain unauthorized access to sensitive systems and data, leading to potential
  data breaches and further compromise of the network.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk where All_Risk.analyticstories="Active
  Directory Privilege Escalation" All_Risk.risk_object_type="system" by All_Risk.risk_object
  All_Risk.risk_object_type All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | where
  source_count >= 4 | `active_directory_privilege_escalation_identified_filter`'
how_to_implement: Splunk Enterprise Security is required to utilize this correlation.
  In addition, modify the source_count value to your environment. In our testing,
  a count of 4 or 5 was decent in a lab, but the number may need to be increased as
  the analytic story includes over 30 analytics. In addition, based on false positives,
  modify any analytics to be anomaly and lower or increase risk based on organization
  importance.
known_false_positives: False positives will most likely be present based on risk scoring
  and how the organization handles system to system communication. Filter, or modify
  as needed. In addition to count by analytics, adding a risk score may be useful.
  In our testing, with 22 events over 30 days, the risk scores ranged from 500 to
  80,000. Your organization will be different, monitor and modify as needed.
references:
- https://attack.mitre.org/tactics/TA0004/
- https://research.splunk.com/stories/active_directory_privilege_escalation/
drilldown_searches:
- name: View the detection results for - "$risk_object$"
  search: '%original_detection_search% | search  risk_object = "$risk_object$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$risk_object$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$risk_object$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
tags:
  analytic_story:
  - Active Directory Privilege Escalation
  asset_type: Endpoint
  atomic_guid: []
  mitre_attack_id:
  - T1484
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
