name: Detect Certipy File Modifications
id: 7e3df743-b1d8-4631-8fa8-bd5819688876
version: 7
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: The following analytic detects the use of the Certipy tool to enumerate
  Active Directory Certificate Services (AD CS) environments by identifying unique
  file modifications. It leverages endpoint process and filesystem data to spot the
  creation of files with specific names or extensions associated with Certipy's information
  gathering and exfiltration activities. This activity is significant as it indicates
  potential reconnaissance and data exfiltration efforts by an attacker. If confirmed
  malicious, this could lead to unauthorized access to sensitive AD CS information,
  enabling further attacks or privilege escalation within the network.
data_source:
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from 
  datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("*_certipy.zip","*_certipy.txt", "*_certipy.json", "*.ccache") 
  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time 
  Filesystem.file_name Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id 
  Filesystem.user Filesystem.vendor_product 
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` 
  | `detect_certipy_file_modifications_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints as well as file creation or deletion events.
known_false_positives: Unknown
references:
- https://github.com/ly4k/Certipy
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Suspicious files $file_name$ related to Certipy detected on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 45
  - field: user
    type: user
    score: 45
  threat_objects:
  - field: file_name
    type: file_name
tags:
  analytic_story:
  - Windows Certificate Services
  - Data Exfiltration
  - Ingress Tool Transfer
  asset_type: Endpoint
  mitre_attack_id:
  - T1649
  - T1560
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1649/certify_abuse/certify_esc1_abuse_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
