name: Enable WDigest UseLogonCredential Registry
id: 0c7d8ffe-25b1-11ec-9f39-acde48001122
version: 12
date: '2025-05-02'
author: Teoderick Contreras, Splunk, Steven Dick
status: production
type: TTP
description:
  The following analytic detects a suspicious registry modification that
  enables the plain text credential feature in Windows by setting the "UseLogonCredential"
  value to 1 in the WDigest registry path. This detection leverages data from the
  Endpoint.Registry data model, focusing on specific registry paths and values. This
  activity is significant because it is commonly used by malware and tools like Mimikatz
  to dump plain text credentials, indicating a potential credential dumping attempt.
  If confirmed malicious, this could allow an attacker to obtain sensitive credentials,
  leading to further compromise and lateral movement within the network.
data_source:
  - Sysmon EventID 13
search:
  '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\System\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\*"
  Registry.registry_value_name = "UseLogonCredential" Registry.registry_value_data=0x00000001)
  by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
  Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
  Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `enable_wdigest_uselogoncredential_registry_filter`'
how_to_implement:
  To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the official
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: unknown
references:
  - https://www.csoonline.com/article/3438824/how-to-detect-and-halt-credential-theft-via-windows-wdigest.html
drilldown_searches:
  - name: View the detection results for - "$user$" and "$dest$"
    search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$user$" and "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
      "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
      as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
      Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
      as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
      by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: wdigest registry $registry_path$ was modified on $dest$
  risk_objects:
    - field: user
      type: user
      score: 80
    - field: dest
      type: system
      score: 80
  threat_objects: []
tags:
  analytic_story:
    - Credential Dumping
    - Windows Registry Abuse
    - CISA AA22-320A
  asset_type: Endpoint
  mitre_attack_id:
    - T1112
    - T1003
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1112/atomic_red_team/wdigest_windows-sysmon.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
