name: Excessive Usage Of Taskkill
id: fe5bca48-accb-11eb-a67c-acde48001122
version: 8
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies excessive usage of `taskkill.exe`,
  a command-line utility used to terminate processes. The detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on instances where `taskkill.exe`
  is executed ten or more times within a one-minute span. This behavior is significant
  as adversaries often use `taskkill.exe` to disable security tools or other critical
  processes to evade detection. If confirmed malicious, this activity could allow
  attackers to bypass security defenses, maintain persistence, and further compromise
  the system.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Processes.action) as action values(Processes.dest) as dest values(Processes.original_file_name)
  as original_file_name values(Processes.parent_process) as parent_process values(Processes.parent_process_exec)
  as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid
  values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_path)
  as parent_process_path values(Processes.process) as process values(Processes.process_exec)
  as process_exec values(Processes.process_guid) as process_guid values(Processes.process_hash)
  as process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level)
  as process_integrity_level values(Processes.process_path) as process_path values(Processes.user)
  as user  values(Processes.user_id) as user_id values(Processes.vendor_product) as
  vendor_product from datamodel=Endpoint.Processes where Processes.process_name =
  "taskkill.exe" by Processes.parent_process_name Processes.process_name Processes.dest
  Processes.user _time span=1m | where count >=10 | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `excessive_usage_of_taskkill_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unknown. Filter as needed.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.joesandbox.com/analysis/702680/0/html
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Excessive usage  of taskkill.exe with process id $process_id$ (more than
    10 within 1m) has been detected on $dest$ with a parent process of $parent_process_name$.
  risk_objects:
  - field: dest
    type: system
    score: 28
  threat_objects:
  - field: parent_process_name
    type: parent_process_name
tags:
  analytic_story:
  - Azorult
  - AgentTesla
  - CISA AA22-277A
  - NjRAT
  - CISA AA22-264A
  - XMRig
  - Crypto Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1562.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
