name: Excessive Attempt To Disable Services
id: 8fa2a0f0-acd9-11eb-8994-acde48001122
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies a suspicious series of command-line
  executions attempting to disable multiple services. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on processes where "sc.exe" is used
  with parameters like "config" or "Disabled" within a short time frame. This activity
  is significant as it may indicate an adversary's attempt to disable security or
  other critical services to further compromise the system. If confirmed malicious,
  this could lead to the attacker achieving persistence, evading detection, or disabling
  security mechanisms, thereby increasing the risk of further exploitation.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` values(Processes.action) as action
  values(Processes.original_file_name) as original_file_name values(Processes.parent_process)
  as parent_process values(Processes.parent_process_exec) as parent_process_exec values(Processes.parent_process_guid)
  as parent_process_guid values(Processes.parent_process_id) as parent_process_id
  values(Processes.parent_process_path) as parent_process_path values(Processes.process)
  as process values(Processes.process_exec) as process_exec values(Processes.process_guid)
  as process_guid values(Processes.process_hash) as process_hash values(Processes.process_id)
  as process_id values(Processes.process_integrity_level) as process_integrity_level
  values(Processes.process_path) as process_path values(Processes.user_id) as user_id
  values(Processes.vendor_product) as vendor_product  count min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name
  = "sc.exe" AND Processes.process="*config*" OR Processes.process="*Disabled*" by
  Processes.process_name Processes.parent_process_name Processes.dest Processes.user
  _time span=1m | where count >=4 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_attempt_to_disable_services_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: An excessive amount of $process_name$ was executed on $dest$ attempting
    to disable services.
  risk_objects:
  - field: dest
    type: system
    score: 80
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - XMRig
  - Azorult
  asset_type: Endpoint
  mitre_attack_id:
  - T1489
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
