name: Excessive Usage Of SC Service Utility
id: cb6b339e-d4c6-11eb-a026-acde48001122
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic detects excessive usage of the `sc.exe` service
  utility on a host machine. It leverages Sysmon EventCode 1 logs to identify instances
  where `sc.exe` is executed more frequently than normal within a 15-minute window.
  This behavior is significant as it is commonly associated with ransomware, cryptocurrency
  miners, and other malware attempting to create, modify, delete, or disable services,
  potentially related to security applications or for privilege escalation. If confirmed
  malicious, this activity could allow attackers to manipulate critical services,
  leading to system compromise or disruption of security defenses.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count as numScExe min(_time) as
  firstTime max(_time) as lastTime values(Processes.action) as action values(Processes.original_file_name)
  as original_file_name values(Processes.parent_process_exec) as parent_process_exec
  values(Processes.parent_process_guid) as parent_process_guid values(Processes.parent_process_name)
  as parent_process_name values(Processes.parent_process_path) as parent_process_path
  values(Processes.process) as process values(Processes.process_exec) as process_exec
  values(Processes.process_guid) as process_guid values(Processes.process_hash) as
  process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level)
  as process_integrity_level values(Processes.process_path) as process_path values(Processes.user_id)
  as user_id values(Processes.vendor_product) as vendor_product values(Processes.parent_process)
  as parent_process values(Processes.process_name) as process_name values(Processes.parent_process_id)
  as parent_process_id values(Processes.user) as user from datamodel=Endpoint.Processes
  where Processes.process_name = "sc.exe" by Processes.dest _time span=15m | `drop_dm_object_name(Processes)`
  | eventstats avg(numScExe) as avgScExe, stdev(numScExe) as stdScExe, count as numSlots
  by dest | eval upperThreshold=(avgScExe + stdScExe *3) | eval isOutlier=if(avgScExe
  > 5 and avgScExe >= upperThreshold, 1, 0) | search isOutlier=1 | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_usage_of_sc_service_utility_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed taskkill.exe may be used.
known_false_positives: excessive execution of sc.exe is quite suspicious since it
  can modify or execute app in high privilege permission.
references:
- https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Excessive Usage Of SC Service Utility
  risk_objects:
  - field: dest
    type: system
    score: 25
  threat_objects: []
tags:
  analytic_story:
  - Azorult
  - Ransomware
  - Crypto Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1569.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data2/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
