name: Excessive File Deletion In WinDefender Folder
id: b5baa09a-7a05-11ec-8da4-acde48001122
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk, Steven Dick
status: production
type: TTP
description: The following analytic detects excessive file deletion events in the
  Windows Defender folder. It leverages Sysmon EventCodes 23 and 26 to identify processes
  deleting multiple files within this directory. This behavior is significant as it
  may indicate an attempt to corrupt or disable Windows Defender, a key security component.
  If confirmed malicious, this activity could allow an attacker to disable endpoint
  protection, facilitating further malicious actions without detection.
data_source:
- Sysmon EventID 23
- Sysmon EventID 26
search: '`sysmon` EventCode IN ("23","26") TargetFilename = "*\\ProgramData\\Microsoft\\Windows
  Defender\\*" | stats count min(_time) as firstTime, max(_time) as lastTime values(file_path)
  as file_path values(file_hash) as file_hash values(file_name) as file_name values(file_modify_time)
  as file_modify_time values(process_name) as process_name values(process_path) as
  process_path values(process_guid) as process_guid values(process_id) as process_id
  values(process_exec) as process_exec by action dest dvc signature signature_id user
  user_id vendor_product | where count >=50 | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_file_deletion_in_windefender_folder_filter`'
how_to_implement: To successfully implement this search, you must ingest logs that
  include the process name, TargetFilename, and ProcessID executions from your endpoints.
  If you are utilizing Sysmon, ensure you have at least version 2.0 of the Sysmon
  TA installed.
known_false_positives: Windows Defender AV updates may trigger this alert. Please
  adjust the filter macros to mitigate false positives.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Excessive file deletion events were detected in the Windows Defender folder
    on $dest$ by $user$. Investigate further to determine if this activity is malicious.
  risk_objects:
  - field: user
    type: user
    score: 25
  - field: dest
    type: system
    score: 25
  threat_objects:
  - field: file_name
    type: file_name
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  - BlackByte Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1485
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/excessive_file_del_in_windefender_dir/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
