name: IcedID Exfiltrated Archived File Creation
id: 0db4da70-f14b-11eb-8043-acde48001122
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
description: The following analytic detects the creation of suspicious files named
  passff.tar and cookie.tar, which are indicative of archived stolen browser information
  such as history and cookies on a machine compromised with IcedID. It leverages Sysmon
  EventCode 11 to identify these specific filenames. This activity is significant
  because it suggests that sensitive browser data has been exfiltrated, which could
  lead to further exploitation or data breaches. If confirmed malicious, this could
  allow attackers to access personal information, conduct further phishing attacks,
  or escalate their presence within the network.
data_source:
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count values(Filesystem.file_path)
  as file_path min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem
  where Filesystem.file_path="*\\passff.tar" OR Filesystem.file_path="*\\cookie.tar"
  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
  Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
  Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` |
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `icedid_exfiltrated_archived_file_creation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://www.cisecurity.org/insights/white-papers/security-primer-icedid
tags:
  analytic_story:
  - IcedID
  asset_type: Endpoint
  mitre_attack_id:
  - T1560.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/simulated_icedid/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
