name: Linux Ingress Tool Transfer Hunting
id: 52fd468b-cb6d-48f5-b16a-92f1c9bb10cf
version: 8
date: '2025-05-02'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic detects the use of 'curl' and 'wget' commands
  within a Linux environment. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names, user information, and command-line executions.
  This activity is significant as 'curl' and 'wget' are commonly used for downloading
  files, which can indicate potential ingress of malicious tools. If confirmed malicious,
  this activity could lead to unauthorized code execution, data exfiltration, or further
  compromise of the system. Monitoring and tuning this detection helps identify and
  differentiate between normal and potentially harmful usage.
data_source:
- Sysmon for Linux EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=curl
  OR Processes.process_name=wget) by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
  Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_ingress_tool_transfer_hunting_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives will be present. This query is meant to help
  tune other curl and wget analytics.
references:
- https://gtfobins.github.io/gtfobins/curl/
- https://curl.se/docs/manpage.html#-I
- https://gtfobins.github.io/gtfobins/curl/
- https://github.com/rapid7/metasploit-framework/search?q=curl
tags:
  analytic_story:
  - Ingress Tool Transfer
  - Linux Living Off The Land
  - XorDDos
  asset_type: Endpoint
  mitre_attack_id:
  - T1105
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1105/atomic_red_team/curl-linux-sysmon.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon:linux
