name: Linux System Network Discovery
id: 535cb214-8b47-11ec-a2c7-acde48001122
version: 6
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies potential enumeration of local network
  configuration on Linux systems. It detects this activity by monitoring processes
  such as "arp," "ifconfig," "ip," "netstat," "firewall-cmd," "ufw," "iptables," "ss,"
  and "route" within a 30-minute window. This behavior is significant as it often
  indicates reconnaissance efforts by adversaries to gather network information for
  subsequent attacks. If confirmed malicious, this activity could enable attackers
  to map the network, identify vulnerabilities, and plan further exploitation or lateral
  movement within the environment.
data_source:
- Sysmon for Linux EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Processes.action) as action values(Processes.dest) as dest values(Processes.original_file_name)
  as original_file_name values(Processes.parent_process) as parent_process values(Processes.parent_process_exec)
  as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid
  values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_name)
  as parent_process_name values(Processes.parent_process_path) as parent_process_path
  values(Processes.process) as process values(Processes.process_exec) as process_exec
  values(Processes.process_guid) as process_guid values(Processes.process_hash) as
  process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level)
  as process_integrity_level values(Processes.process_name) as process_name values(Processes.process_path)
  as process_path values(Processes.user) as user  values(Processes.user_id) as user_id
  values(Processes.vendor_product) as vendor_product dc(Processes.process_name) as
  process_name_count from datamodel=Endpoint.Processes where Processes.process_name
  IN ("arp", "ifconfig", "ip", "netstat", "firewall-cmd", "ufw", "iptables", "ss",
  "route") by _time span=30m Processes.dest Processes.user | where process_name_count>=4
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `linux_system_network_discovery_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Network discovery process $process$ executed on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 9
  threat_objects: []
tags:
  analytic_story:
  - Data Destruction
  - Network Discovery
  - Industroyer2
  asset_type: Endpoint
  mitre_attack_id:
  - T1016
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1016/atomic_red_team/linux_net_discovery/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon:linux
