name: Modification Of Wallpaper
id: accb0712-c381-11eb-8e5b-acde48001122
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic detects the modification of registry keys related
  to the desktop wallpaper settings. It leverages Sysmon EventCode 13 to identify
  changes to the "Control Panel\\Desktop\\Wallpaper" and "Control Panel\\Desktop\\WallpaperStyle"
  registry keys, especially when the modifying process is not explorer.exe or involves
  suspicious file paths like temp or public directories. This activity is significant
  as it can indicate ransomware behavior, such as the REVIL ransomware, which changes
  the wallpaper to display a ransom note. If confirmed malicious, this could signify
  a compromised machine and the presence of ransomware, leading to potential data
  encryption and extortion.
data_source:
- Sysmon EventID 13
search: '`sysmon` EventCode =13  (TargetObject IN ("*\\Control Panel\\Desktop\\Wallpaper","*\\Control
  Panel\\Desktop\\WallpaperStyle") AND Image != "*\\explorer.exe") OR (TargetObject
  IN ("*\\Control Panel\\Desktop\\Wallpaper","*\\Control Panel\\Desktop\\WallpaperStyle")
  AND Details IN ("*\\temp\\*", "*\\users\\public\\*")) | stats count min(_time) as
  firstTime max(_time) as lastTime by action dest process_guid process_id registry_hive
  registry_path registry_key_name registry_value_data registry_value_name status user_id
  vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `modification_of_wallpaper_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Image, TargetObject registry key, registry Details from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: 3rd party tool may used to changed the wallpaper of the machine
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
- https://news.sophos.com/en-us/2020/04/24/lockbit-ransomware-borrows-tricks-to-keep-up-with-revil-and-maze/
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Wallpaper modification on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 54
  threat_objects: []
tags:
  analytic_story:
  - Revil Ransomware
  - Rhysida Ransomware
  - LockBit Ransomware
  - BlackMatter Ransomware
  - Brute Ratel C4
  - Windows Registry Abuse
  - Black Basta Ransomware
  - Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1491
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/revil/inf1/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
