name: Non Chrome Process Accessing Chrome Default Dir
id: 81263de4-160a-11ec-944f-acde48001122
version: 12
date: '2025-07-16'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic detects a non-Chrome process accessing files in
  the Chrome user default folder. It leverages Windows Security Event logs, specifically
  event code 4663, to identify unauthorized access attempts. This activity is significant
  because the Chrome default folder contains sensitive user data such as login credentials,
  browsing history, and cookies. If confirmed malicious, this behavior could indicate
  an attempt to exfiltrate sensitive information, often associated with RATs, trojans,
  and advanced persistent threats like FIN7. Such access could lead to data theft
  and further compromise of the affected system.
data_source:
- Windows Event Log Security 4663
search: '`wineventlog_security` EventCode=4663 NOT (ProcessName IN ("*\\chrome.exe",
  "*\\explorer.exe", "*sql*", "*\\dllhost.exe")) ObjectName="*\\Google\\Chrome\\User
  Data\\Default*" | stats count min(_time) as firstTime max(_time) as lastTime by
  ObjectName ObjectType ProcessName AccessMask EventCode dest | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `non_chrome_process_accessing_chrome_default_dir_filter`'
how_to_implement: To successfully implement this search, you must ingest Windows Security
  Event logs and track event code 4663. For 4663, enable "Audit Object Access" in
  Group Policy. Then check the two boxes listed for both "Success" and "Failure."
known_false_positives: other browser not listed related to chrome may catch by this
  rule.
references: []
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: a non chrome browser process $ProcessName$ accessing $ObjectName$
  risk_objects:
  - field: dest
    type: system
    score: 35
  threat_objects: []
tags:
  analytic_story:
  - CISA AA23-347A
  - Phemedrone Stealer
  - DarkGate Malware
  - NjRAT
  - Malicious Inno Setup Loader
  - Salt Typhoon
  - Remcos
  - Warzone RAT
  - Quasar RAT
  - 3CX Supply Chain Attack
  - AgentTesla
  - FIN7
  - SnappyBee
  - RedLine Stealer
  - Snake Keylogger
  - China-Nexus Threat Activity
  asset_type: Endpoint
  mitre_attack_id:
  - T1555.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1555/non_chrome_process_accessing_chrome_default_dir/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
