name: PowerShell - Connect To Internet With Hidden Window
id: ee18ed37-0802-4268-9435-b3b91aaa18db
version: 14
date: '2025-05-02'
author: David Dorsey, Michael Haag Splunk
status: production
type: Hunting
description: The following analytic detects PowerShell commands using the WindowStyle
  parameter to hide the window while connecting to the Internet. This behavior is
  identified through Endpoint Detection and Response (EDR) telemetry, focusing on
  command-line executions that include variations of the WindowStyle parameter. This
  activity is significant because it attempts to bypass default PowerShell execution
  policies and conceal its actions, which is often indicative of malicious intent.
  If confirmed malicious, this could allow an attacker to execute commands stealthily,
  potentially leading to unauthorized data exfiltration or further compromise of the
  endpoint.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes where `process_powershell` by Processes.action\
  \ Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec\
  \ Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name\
  \ Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid\
  \ Processes.process_hash Processes.process_id Processes.process_integrity_level\
  \ Processes.process_name Processes.process_path Processes.user Processes.user_id\
  \ Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`\
  \ | `security_content_ctime(lastTime)` | where match(process,\"(?i)[\\-|\\/|\u2013\
  \ |\u2014|\u2015]w(in*d*o*w*s*t*y*l*e*)*\\s+[^-]\") | `powershell___connect_to_internet_with_hidden_window_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Legitimate process can have this combination of command-line
  options, but it's not common.
references:
- https://regexr.com/663rr
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/Windows/TestHarnesses/T1059.001_PowerShell/OutPowerShellCommandLineParameter.ps1
- https://ss64.com/ps/powershell.html
- https://twitter.com/M_haggis/status/1440758396534214658?s=20
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
tags:
  analytic_story:
  - AgentTesla
  - HAFNIUM Group
  - Hermetic Wiper
  - Possible Backdoor Activity Associated With MUDCARP Espionage Campaigns
  - Malicious PowerShell
  - Data Destruction
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  cve:
  - CVE-2021-44228
  mitre_attack_id:
  - T1059.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/hidden_powershell/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
