name: Rubeus Kerberos Ticket Exports Through Winlogon Access
id: 5ed8c50a-8869-11ec-876f-acde48001122
version: 9
date: '2025-05-02'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects a process accessing the winlogon.exe system
  process, indicative of the Rubeus tool attempting to export Kerberos tickets from
  memory. This detection leverages Sysmon EventCode 10 logs, focusing on processes
  obtaining a handle to winlogon.exe with specific access rights. This activity is
  significant as it often precedes pass-the-ticket attacks, where adversaries use
  stolen Kerberos tickets to move laterally within an environment. If confirmed malicious,
  this could allow attackers to bypass normal access controls, escalate privileges,
  and persist within the network, posing a severe security risk.
data_source:
- Sysmon EventID 10
search: '`sysmon` EventCode=10 TargetImage=C:\\Windows\\system32\\winlogon.exe (GrantedAccess=0x1f3fff)
  (SourceImage!=C:\\Windows\\system32\\svchost.exe AND SourceImage!=C:\\Windows\\system32\\lsass.exe
  AND SourceImage!=C:\\Windows\\system32\\LogonUI.exe AND SourceImage!=C:\\Windows\\system32\\smss.exe
  AND SourceImage!=C:\\Windows\\system32\\wbem\\wmiprvse.exe) | stats count min(_time)
  as firstTime max(_time) as lastTime by CallTrace EventID GrantedAccess Guid Opcode
  ProcessID SecurityID SourceImage SourceProcessGUID SourceProcessId TargetImage TargetProcessGUID
  TargetProcessId UserID dest granted_access parent_process_exec parent_process_guid
  parent_process_id parent_process_name parent_process_path process_exec process_guid
  process_id process_name process_path signature signature_id user_id vendor_product
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `rubeus_kerberos_ticket_exports_through_winlogon_access_filter`'
how_to_implement: This search needs Sysmon Logs and a sysmon configuration, which
  includes EventCode 10. This search uses an input macro named `sysmon`. We strongly
  recommend that you specify your environment-specific configurations (index, source,
  sourcetype, etc.) for Windows Sysmon logs. Replace the macro definition with configurations
  for your Splunk environment.
known_false_positives: Legitimate applications may obtain a handle for winlogon.exe.
  Filter as needed
references:
- https://github.com/GhostPack/Rubeus
- https://web.archive.org/web/20210725005734/http://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
- https://attack.mitre.org/techniques/T1550/003/
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Winlogon.exe was accessed by $SourceImage$ on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 36
  threat_objects:
  - field: TargetImage
    type: process
tags:
  analytic_story:
  - CISA AA23-347A
  - Active Directory Kerberos Attacks
  - BlackSuit Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1550.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1550.003/rubeus/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
