name: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
version: 16
date: '2025-07-16'
author: David Dorsey, Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects the use of 'schtasks.exe' to create a
  scheduled task on a remote system, indicating potential lateral movement or remote
  code execution. It leverages process data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command-line arguments and flags. This activity is
  significant as it may signify an adversary's attempt to persist or execute code
  remotely. If confirmed malicious, this could allow attackers to maintain access,
  execute arbitrary commands, or further infiltrate the network, posing a severe security
  risk.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name = schtasks.exe
  OR Processes.original_file_name=schtasks.exe) (Processes.process="*/create*" AND
  Processes.process="*/s *") by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
  Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `schtasks_scheduling_job_on_remote_system_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: While it is possible to have false positives, due to legitimate
  administrative tasks, these are usually limited and should still be validated and
  investigated as appropriate.
references: []
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A scheduled task process $process_name$ with remote job command-line $process$
    on host $dest$ by $user$.
  risk_objects:
  - field: dest
    type: system
    score: 63
  - field: user
    type: user
    score: 63
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Scheduled Tasks
  - Phemedrone Stealer
  - Living Off The Land
  - Prestige Ransomware
  - Quasar RAT
  - RedLine Stealer
  - Active Directory Lateral Movement
  - NOBELIUM Group
  - Compromised Windows Host
  asset_type: Endpoint
  mitre_attack_id:
  - T1053.005
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
