name: Shim Database File Creation
id: 6e4c4588-ba2f-42fa-97e6-9f6f548eaa33
version: 10
date: '2025-05-02'
author: David Dorsey, Splunk
status: production
type: TTP
description: The following analytic detects the creation of shim database files (.sdb)
  in default directories using the sdbinst.exe application. It leverages filesystem
  activity data from the Endpoint.Filesystem data model to identify file writes to
  the Windows\AppPatch\Custom directory. This activity is significant because shims
  can intercept and alter API calls, potentially allowing attackers to bypass security
  controls or execute malicious code. If confirmed malicious, this could lead to unauthorized
  code execution, privilege escalation, or persistent access within the environment.
data_source:
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count values(Filesystem.action)
  values(Filesystem.file_hash) as file_hash values(Filesystem.file_path) as file_path  min(_time)
  as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path=*Windows\\AppPatch\\Custom*
  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
  Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
  Filesystem.user Filesystem.vendor_product | `security_content_ctime(lastTime)` |
  `security_content_ctime(firstTime)` |`drop_dm_object_name(Filesystem)` | `shim_database_file_creation_filter`'
how_to_implement: You must be ingesting data that records the filesystem activity
  from your hosts to populate the Endpoint file-system data model node. If you are
  using Sysmon, you will need a Splunk Universal Forwarder on each endpoint from which
  you want to collect data.
known_false_positives: Because legitimate shim files are created and used all the
  time, this event, in itself, is not suspicious. However, if there are other correlating
  events, it may warrant further investigation.
references: []
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A process that possibly write shim database in $file_path$ in host $dest$
  risk_objects:
  - field: dest
    type: system
    score: 56
  threat_objects:
  - field: file_path
    type: file_path
tags:
  analytic_story:
  - Windows Persistence Techniques
  asset_type: Endpoint
  mitre_attack_id:
  - T1546.011
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.011/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
