name: Short Lived Windows Accounts
id: b25f6f62-0782-43c1-b403-083231ffd97d
version: 10
date: '2025-09-16'
author: David Dorsey, Bhavin Patel, Splunk
status: production
type: TTP
description: The following analytic detects the rapid creation and deletion of Windows
  accounts within a short time frame of 1 hour. It leverages the "Change" data model
  in Splunk, specifically monitoring events with result IDs 4720 (account creation)
  and 4726 (account deletion). This behavior is significant as it may indicate an
  attacker attempting to create and remove accounts quickly to evade detection or
  gain unauthorized access. If confirmed malicious, this activity could lead to unauthorized
  access, privilege escalation, or further malicious actions within the environment.
  Immediate investigation of flagged events is crucial to mitigate potential damage.
data_source:
- Windows Event Log System 4720
- Windows Event Log System 4726
search: '| tstats `security_content_summariesonly` values(All_Changes.result_id) as
  result_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Change
  where All_Changes.result_id=4720 OR All_Changes.result_id=4726 by _time span=1h
  All_Changes.user All_Changes.dest All_Changes.Account_Management.src All_Changes.Account_Management.src_user
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name("All_Changes")`
  | `drop_dm_object_name("Account_Management")` | transaction user connected=false
  maxspan=60m | eval create_result_id=mvindex(result_id, 0) | eval delete_result_id=mvindex(result_id,
  1) | search create_result_id = 4720 delete_result_id=4726 | table firstTime lastTime
  count user src src_user dest create_result_id delete_result_id | `short_lived_windows_accounts_filter`'
how_to_implement: 'This search requires you to have enabled your Group Management
  Audit Logs in your Local Windows Security Policy and be ingesting those logs.  More
  information on how to enable them can be found here: http://whatevernetworks.com/auditing-group-membership-changes-in-active-directory/.
  We also recommend adjsuting the maxspan and _time parameter to better fit your environment.'
known_false_positives: It is possible that an administrator created and deleted an
  account in a short time period.  Verifying activity with an administrator is advised.
references:
- https://www.youtube.com/watch?v=D4Cd-KK4ctk
- https://attack.mitre.org/techniques/T1078/
drilldown_searches:
- name: View the detection results for - "$dest$" and "$src_user$"
  search: '%original_detection_search% | search  dest = "$dest$" src_user = "$src_user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A user account $user$ is created and deleted within a short time period
    on host $dest$ by user $src_user$
  risk_objects:
  - field: dest
    type: system
    score: 63
  - field: src_user
    type: user
    score: 63
  threat_objects: []
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - GhostRedirector IIS Module and Rungan Backdoor
  asset_type: Windows
  mitre_attack_id:
  - T1078.003
  - T1136.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: access
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.001/atomic_red_team/windows-security.log
    source: WinEventLog:Security
    sourcetype: WinEventLog
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.001/atomic_red_team/windows-system.log
    source: WinEventLog:System
    sourcetype: WinEventLog
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.001/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
