name: Spoolsv Writing a DLL - Sysmon
id: 347fd388-da87-11eb-836d-acde48001122
version: 8
date: '2025-05-02'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects `spoolsv.exe` writing a `.dll` file, which
  is unusual behavior and may indicate exploitation of vulnerabilities like CVE-2021-34527
  (PrintNightmare). This detection leverages Sysmon EventID 11 to monitor file creation
  events in the `\spool\drivers\x64\` directory. This activity is significant because
  `spoolsv.exe` typically does not write DLL files, and such behavior could signify
  an ongoing attack. If confirmed malicious, this could allow an attacker to execute
  arbitrary code, escalate privileges, or maintain persistence on the compromised
  system.
data_source:
- Sysmon EventID 11
search: '`sysmon` EventID=11 process_name=spoolsv.exe file_path="*\\spool\\drivers\\x64\\*"
  file_name=*.dll | stats count min(_time) as firstTime max(_time) as lastTime by
  action dest file_name file_path  process_guid process_id user_id vendor_product
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `spoolsv_writing_a_dll___sysmon_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: Limited false positives. Filter as needed.
references:
- https://github.com/cube0x0/impacket/commit/73b9466c17761384ece11e1028ec6689abad6818
- https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
- https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
- https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A process has been identified writing dll's to $file_path$ on endpoint
    $dest$. This behavior is suspicious and related to PrintNightmare.
  risk_objects:
  - field: dest
    type: system
    score: 72
  threat_objects:
  - field: file_name
    type: file_name
tags:
  analytic_story:
  - PrintNightmare CVE-2021-34527
  - Black Basta Ransomware
  asset_type: Endpoint
  cve:
  - CVE-2021-34527
  mitre_attack_id:
  - T1547.012
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.012/printnightmare/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
