name: Windows Unusual SysWOW64 Process Run System32 Executable
id: e4602172-db86-4315-86df-da66fb40bcde
version: 3
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic detects an unusual process execution pattern where
  a process running from C:\Windows\SysWOW64\ attempts to execute a binary from C:\Windows\System32\.
  In a typical Windows environment, 32-bit processes under SysWOW64 should primarily
  interact with 32-bit binaries within the same directory. However, an execution flow
  where a 32-bit process spawns a 64-bit binary from System32 can indicate potential
  process injection, privilege escalation, evasion techniques, or unauthorized execution
  hijacking.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_path = "*\\Windows\\SysWOW64\\*"
  AND Processes.process = "*windows\\system32\\*" by Processes.action Processes.dest
  Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_unusual_syswow64_process_run_system32_executable_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: some legitimate system processes, software updaters, or compatibility
  tools may trigger this behavior, occurrences involving unknown, unsigned, or unusual
  parent processes should be investigated for potential malware activity, persistence
  mechanisms, or execution flow hijacking.
references:
- https://www.trendmicro.com/en_nl/research/24/k/earth-estries.html
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: a 32 bit process execute 64 bit executable on [$dest$].
  risk_objects:
  - field: dest
    type: system
    score: 40
  threat_objects:
  - field: process_path
    type: process_name
tags:
  analytic_story:
  - DarkGate Malware
  - Salt Typhoon
  - China-Nexus Threat Activity
  asset_type: Endpoint
  mitre_attack_id:
  - T1036.009
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1036.009/32bit_process_execute_64bit/32bit_spawn_64bit.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
