name: Windows New Deny Permission Set On Service SD Via Sc.EXE
id: d0f6a5e5-dbfd-46e1-8bd5-2e2905947c33
version: 4
date: '2025-05-02'
author: Nasreddine Bencherchali, Michael Haag, Splunk
status: production
type: Anomaly
description: The following analytic detects changes in a service security descriptor
  where a new deny ace has been added. It leverages data from Endpoint Detection and
  Response (EDR) agents, specifically searching for any process execution involving
  the "sc.exe" binary with the "sdset" flag targeting any service and adding a dedicated
  deny ace. If confirmed malicious, this could allow an attacker to escalate their
  privileges, blind defenses and more.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name=sc.exe OR Processes.original_file_name=sc.exe) Processes.process="*sdset
  *" Processes.process="*(D;*" Processes.process IN ("*;IU*", "*;S-1-5-4*", "*;SU*",
  "*;S-1-5-6*", "*;BA*", "*;S-1-5-32-544*", "*;SY*", "*;S-1-5-18*", "*;WD*", "*;S-1-1-0*",
  "*;AU*", "*;S-1-5-11*", "*;LS*", "*;S-1-5-19*") by Processes.action Processes.dest
  Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_new_deny_permission_set_on_service_sd_via_sc_exe_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process name, and process original file name.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: None identified. Attempts to add deny aces to services, especially
  security-related services should be immediately investigated.
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://news.sophos.com/wp-content/uploads/2020/06/glupteba_final-1.pdf
- https://attack.mitre.org/techniques/T1564/
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    attempting to disable security services on endpoint $dest$ by user $user$.
  risk_objects:
  - field: user
    type: user
    score: 30
  - field: dest
    type: system
    score: 30
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Defense Evasion or Unauthorized Access Via SDDL Tampering
  asset_type: Endpoint
  mitre_attack_id:
  - T1564
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1564/sc_sdset_tampering/sc_sdset_tampering_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
