name: Windows Compatibility Telemetry Tampering Through Registry
id: 43834687-cc48-4878-a2fa-f76e4271791f
version: 4
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: This detection identifies suspicious modifications to the Windows Compatibility
  Telemetry registry settings, specifically within the "TelemetryController" registry
  key and "Command" registry value. It leverages data from the Endpoint.Registry data
  model, focusing on registry paths and values indicative of such changes. This activity
  is significant because CompatTelRunner.exe and the "Microsoft Compatibility Appraiser"
  task always run as System and can be used to elevate privileges or establish a highly
  privileged persistence mechanism. If confirmed malicious, this could enable unauthorized
  code execution, privilege escalation, or persistent access to the compromised system.
data_source:
- Sysmon EventID 13
search: "| tstats `security_content_summariesonly` min(_time) as firstTime, max(_time)\
  \ as lastTime, count FROM datamodel=Endpoint.Registry \nWHERE (Registry.registry_path\
  \ = \"*\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\AppCompatFlags\\\
  \\TelemetryController*\" \nAND Registry.registry_value_name=\"Command\" NOT Registry.registry_value_data\
  \ IN (\"(empty)\")) \nby Registry.action Registry.dest Registry.process_guid Registry.process_id\
  \ Registry.registry_hive Registry.registry_path \nRegistry.registry_key_name Registry.registry_value_data\
  \ Registry.registry_value_name  \nRegistry.registry_value_type Registry.status Registry.user\
  \ Registry.vendor_product \n| `drop_dm_object_name(Registry)`\n| eval process =\
  \ registry_value_data \n| `security_content_ctime(firstTime)` \n| `security_content_ctime(lastTime)`\n\
  | `windows_compatibility_telemetry_tampering_through_registry_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: None identified
references:
- https://attack.mitre.org/techniques/T1546/
- https://scythe.io/threat-thursday/windows-telemetry-persistence
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$","$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: Investigate registry changes on $dest$
  search: '| from datamodel Endpoint.Registry | search registry_path = "*\\SOFTWARE\\Microsoft\\Windows
    NT\\CurrentVersion\\AppCompatFlags\\TelemetryController*" AND dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The process $process$ was added to registry settings for the Compatibility
    Appraiser by $user$ on host $dest$
  risk_objects:
  - field: dest
    type: system
    score: 70
  - field: user
    type: user
    score: 70
  threat_objects:
  - field: process
    type: process
tags:
  analytic_story:
  - Windows Persistence Techniques
  asset_type: Endpoint
  mitre_attack_id:
  - T1546
  - T1053.005
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546/compattelrunner_abuse/compattelrunner_abuse.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
