name: Windows File and Directory Permissions Remove Inheritance
id: 9b62da2c-e442-474f-83ca-fac4dabab1b3
version: 3
date: '2025-05-02'
author: Teoderick Contreras, Splunk
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
type: Anomaly
status: production
description: The following analytic detects the removal of permission inheritance
  using ICACLS. This analytic identifies instances where ICACLS is used to remove
  permission inheritance from files or directories. The /inheritance:r flag, which
  strips inherited permissions while optionally preserving or altering explicit permissions,
  is monitored to detect changes that may restrict access or establish isolated permission
  configurations. Removing inheritance can be a legitimate administrative action but
  may also indicate an attempt to conceal malicious activity or bypass inherited security
  controls.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN( "icacls.exe",
  "cacls.exe", "xcacls.exe")  AND Processes.process = "*/inheritance:r*" by Processes.action
  Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_file_and_directory_permissions_remove_inheritance_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators or administrative scripts may use this application.
  Filter as needed.
references:
- https://www.splunk.com/en_us/blog/security/-applocker-rules-as-defense-evasion-complete-analysis.html
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A [$process_name$] was executed on [$dest$] attempting to remove inheritance
    permissions.
  risk_objects:
  - field: dest
    type: system
    score: 49
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Crypto Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1222.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1222.001/icacls_inheritance/icacls_process_1.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
