name: Windows Modify Registry Tamper Protection
id: 12094335-88fc-4c3a-b55f-e62dd8c93c23
version: 8
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
  - Sysmon EventID 13
description:
  The following analytic detects a suspicious modification to the Windows
  Defender Tamper Protection registry setting. It leverages data from the Endpoint
  datamodel, specifically targeting changes where the registry path is set to disable
  Tamper Protection. This activity is significant because disabling Tamper Protection
  can allow adversaries to make further undetected changes to Windows Defender settings,
  potentially leading to reduced security on the system. If confirmed malicious, this
  could enable attackers to evade detection, persist in the environment, and execute
  further malicious activities without interference from Windows Defender.
search:
  '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Microsoft\\Windows
  Defender\\Features\\TamperProtection" AND Registry.registry_value_data="0x00000000"
  by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
  Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
  Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
  | `drop_dm_object_name(Registry)` | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`
  | `windows_modify_registry_tamper_protection_filter`'
how_to_implement:
  To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives:
  Administrators may enable or disable this feature that may
  cause some false positive.
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
drilldown_searches:
  - name: View the detection results for - "$dest$"
    search: '%original_detection_search% | search  dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
      starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
      values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
      as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
      as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
      | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: A registry modification to tamper Windows Defender protection on $dest$
  risk_objects:
    - field: dest
      type: system
      score: 49
  threat_objects: []
tags:
  analytic_story:
    - RedLine Stealer
  asset_type: Endpoint
  atomic_guid:
    - 12e03af7-79f9-4f95-af48-d3f12f28a260
  mitre_attack_id:
    - T1112
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/redline/modify_registry/sysmon.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
