name: Windows Screen Capture in TEMP folder
id: 00524d1f-a032-46f5-9108-e7d9f01bfb3c
version: 5
date: '2025-05-02'
author: Teoderick Contreras, Splunk
data_source:
- Sysmon EventID 11
type: TTP
status: production
description: The following analytic detects the creation of screen capture files by
  the Braodo stealer malware. This stealer is known to capture screenshots of the
  victim's desktop as part of its data theft activities. The detection focuses on
  identifying unusual screen capture activity, especially when images are saved in
  directories often used by malware, such as temporary or hidden folders. Monitoring
  for these files helps to quickly identify malicious screen capture attempts, allowing
  security teams to respond and mitigate potential information exposure before sensitive
  data is compromised.
search: '|tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("screenshot.png",
  "screenshot.jpg","screenshot.bmp") Filesystem.file_path = "*\\temp\\*" by Filesystem.action
  Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash
  Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path Filesystem.file_acl
  Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user
  Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_screen_capture_in_temp_folder_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: unknown
references:
- https://x.com/suyog41/status/1825869470323056748
- https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
drilldown_searches:
- name: View the detection results for "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168 | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A screen capture named as $file_name$ was created on $dest$.
  risk_objects:
  - field: dest
    type: system
    score: 64
  threat_objects: []
tags:
  analytic_story:
  - Crypto Stealer
  - Braodo Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1113
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1113/braodo_screenshot/braodo_screenshot.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
