name: Windows BitLockerToGo Process Execution
id: 68cbc9e9-2882-46f2-b636-3b5080589d58
version: 5
date: '2025-05-02'
author: Michael Haag, Nasreddine Bencherchali, Splunk
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
type: Hunting
status: production
description: The following analytic detects BitLockerToGo.exe execution, which has
  been observed being abused by Lumma stealer malware. The malware leverages this
  legitimate Windows utility to manipulate registry keys, search for cryptocurrency
  wallets and credentials, and exfiltrate sensitive data. This activity is significant
  because BitLockerToGo.exe provides functionality for viewing, copying, and writing
  files as well as modifying registry branches - capabilities that the Lumma stealer
  exploits. However, note that if legitimate use of BitLockerToGo.exe is in the organization,
  this detection will
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=bitlockertogo.exe
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_bitlockertogo_process_execution_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives are likely, as BitLockerToGo.exe is a legitimate
  Windows utility used for managing BitLocker encryption. However, monitor for usage
  of BitLockerToGo.exe in your environment, tune as needed. If BitLockerToGo.exe is
  not used in your environment, move to TTP.
references:
- https://securelist.com/fake-captcha-delivers-lumma-amadey/114312/
tags:
  analytic_story:
  - Lumma Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1218
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218/bitlockertogo/4688_bitlockertogo_windows-security.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
