name: Windows Known Abused DLL Loaded Suspiciously
id: dd6d1f16-adc0-4e87-9c34-06189516b803
version: 8
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: The following analytic detects when DLLs with known abuse history are
  loaded from an unusual location. This activity may represent an attacker performing
  a DLL search order or sideload hijacking technique. These techniques are used to
  gain persistence as well as elevate privileges on the target system. This detection
  relies on Sysmon EID7 and is compatible with all Officla Sysmon TA versions.
data_source:
- Sysmon EventID 7
search: '`sysmon` ImageLoaded EventCode=7 NOT ImageLoaded IN ("*\\Program Files*","*\\system32\\*",
  "*\\syswow64\\*","*\\winsxs\\*","*\\wbem\\*") | stats count min(_time) as firstTime
  max(_time) as lastTime by Image ImageLoaded dest process_exec process_guid process_hash
  process_id process_path service_dll_signature_exists service_dll_signature_verified
  signature signature_id user_id vendor_product loaded_file | rename Image as process
  | eval process_name = case(isnotnull(process),replace(process,"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")),
  loaded_file_path = case(isnotnull(loaded_file), replace(loaded_file, "(:[\w\. ]+)",
  "")), loaded_file = case(isnotnull(loaded_file),replace(loaded_file,"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")),
  user = case(NOT user IN ("-"), replace(user, "(.*)\\\(.+)$","\2")) | lookup hijacklibs_loaded
  library AS loaded_file OUTPUT islibrary comment as desc | lookup hijacklibs_loaded
  library AS loaded_file excludes as loaded_file_path OUTPUT islibrary as excluded
  | search islibrary = TRUE AND excluded = false | stats count min(_time) as firstTime
  max(_time) as lastTime by dest loaded_file loaded_file_path process process_exec
  process_guid process_hash process_id process_name process_path service_dll_signature_exists
  service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_known_abused_dll_loaded_suspiciously_filter`'
how_to_implement: The following analytic requires Sysmon operational logs to be imported,
  with EID7 being mapped to the process_name field. Modify the sysmon macro as needed
  to match the sourcetype or add index.
known_false_positives: DLLs being loaded by user mode programs for legitimate reasons.
references:
- https://attack.mitre.org/techniques/T1574/002/
- https://hijacklibs.net/api/
- https://wietze.github.io/blog/hijacking-dlls-in-windows
- https://github.com/olafhartong/sysmon-modular/pull/195/files
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The module [$loaded_file$] was loaded from an unusual location.
  risk_objects:
  - field: dest
    type: system
    score: 10
  threat_objects: []
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Living Off The Land
  asset_type: Endpoint
  mitre_attack_id:
  - T1574.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.002/hijacklibs/hijacklibs_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
