name: Windows System File on Disk
id: 993ce99d-9cdd-42c7-a2cf-733d5954e5a6
version: 7
date: '2025-05-02'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic detects the creation of new .sys files on disk.
  It leverages the Endpoint.Filesystem data model to identify and log instances where
  .sys files are written to the filesystem. This activity is significant because .sys
  files are often used as kernel mode drivers, and their unauthorized creation can
  indicate malicious activity such as rootkit installation. If confirmed malicious,
  this could allow an attacker to gain kernel-level access, leading to full system
  compromise, persistent control, and the ability to bypass security mechanisms.
data_source:
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name="*.sys*"
  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
  Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
  Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` |
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_system_file_on_disk_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on files from your endpoints into the `Endpoint` datamodel in the `Filesystem` node.
  In addition, confirm the latest CIM App 4.20 or higher is installed and the latest
  TA for the endpoint product. In addition, filtering may occur by adding NOT (Filesystem.file_path
  IN ("*\\Windows\\*", "*\\Program File*", "*\\systemroot\\*","%SystemRoot%*", "system32\*")).
  This will level out the noise generated to potentally lead to generating findings.
known_false_positives: False positives will be present. Filter as needed.
references:
- https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
tags:
  analytic_story:
  - CISA AA22-264A
  - Windows Drivers
  - Crypto Stealer
  asset_type: Endpoint
  mitre_attack_id:
  - T1068
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1068/drivers/sysmon_sys_filemod.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
