name: Windows PowerShell Script Block With Malicious String
id: 0f09cedd-10f1-4b9f-bdea-7a8b06ea575d
version: 3
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: The following analytic detects the execution of multiple offensive toolkits
  and commands by leveraging PowerShell Script Block Logging (EventCode=4104). This
  method captures and logs the full command sent to PowerShell, allowing for the identification
  of suspicious activities including several well-known tools used for credential
  theft, lateral movement, and persistence. If confirmed malicious, this could lead
  to unauthorized access, privilege escalation, and potential compromise of sensitive
  information within the environment.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` ScriptBlockText=* EventCode=4104
  | stats count min(_time) as firstTime max(_time) as lastTime list(ScriptBlockText) as command values(Guid) as Guid values(Opcode) as Opcode values(Name) as Name values(Path) as Path values(ProcessID) as ProcessID values(ScriptBlockId) as ScriptBlockId values(ScriptBlockText) as ScriptBlockText by dest signature signature_id user_id vendor_product 
  | eval command = mvjoin(command,"\n")
  | lookup malicious_powershell_strings command
  | where isnotnull(match)
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_powershell_script_block_with_malicious_string_filter`'
how_to_implement: The following analytic requires PowerShell operational logs to be
  imported. Modify the powershell macro as needed to match the sourcetype or add index.
  This analytic is specific to 4104, or PowerShell Script Block Logging.
known_false_positives: Unknown, possible usage by internal red team or powershell
  commands with overlap.
references:
- https://attack.mitre.org/techniques/T1059/001/
- https://github.com/PowerShellMafia/PowerSploit
- https://github.com/PowerShellEmpire/
- https://github.com/S3cur3Th1sSh1t/PowerSharpPack
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The user $user_id$ ran a known malicious PowerShell string matching *$match$*
    on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 70
  threat_objects:
  - field: signature_id
    type: signature
tags:
  analytic_story:
  - Malicious PowerShell
  asset_type: Endpoint
  mitre_attack_id:
  - T1059.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1552.006/powershell_gpp_discovery/win-powershell.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: XmlWinEventLog
