name: Windows Cmdline Tool Execution From Non-Shell Process
id: 2afa393f-b88d-41b7-9793-623c93a2dfde
version: 7
date: '2025-05-06'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description:
  The following analytic identifies instances where `ipconfig.exe`, `systeminfo.exe`,
  or similar tools are executed by a non-standard shell parent process, excluding
  CMD, PowerShell, or Explorer. This detection leverages Endpoint Detection and Response
  (EDR) telemetry to monitor process creation events. Such behavior is significant
  as it may indicate adversaries using injected processes to perform system discovery,
  a tactic observed in FIN7's JSSLoader. If confirmed malicious, this activity could
  allow attackers to gather critical host information, aiding in further exploitation
  or lateral movement within the network.
data_source:
  - Sysmon EventID 1
  - Windows Event Log Security 4688
  - CrowdStrike ProcessRollup2
search:
  '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN ("ipconfig.exe",
  "systeminfo.exe", "net1.exe", "arp.exe", "nslookup.exe", "route.exe", "netstat.exe", "hostname.exe", "whoami.exe") 
  AND NOT Processes.parent_process_name IN ("cmd.exe", "powershell.exe", "powershell_ise.exe", "pwsh.exe", "explorer.exe", "-", "unknown") 
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_cmdline_tool_execution_from_non_shell_process_filter`'
how_to_implement:
  The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives:
  A network operator or systems administrator may utilize an
  automated host discovery application that may generate false positives. Filter as
  needed.
references:
  - https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
  - https://attack.mitre.org/groups/G0046/
  - https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
drilldown_searches:
  - name: View the detection results for - "$dest$" and "$user$"
    search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$dest$" and "$user$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
      "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
      as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
      Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
      as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
      by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message:
    A non-standard parent process $parent_process_name$ spawned child process
    $process_name$ to execute command-line tool on $dest$.
  risk_objects:
    - field: dest
      type: system
      score: 56
    - field: user
      type: user
      score: 56
  threat_objects:
    - field: parent_process_name
      type: parent_process_name
    - field: process_name
      type: process_name
tags:
  analytic_story:
    - CISA AA22-277A
    - Gozi Malware
    - CISA AA23-347A
    - Qakbot
    - Medusa Ransomware
    - DarkGate Malware
    - Rhysida Ransomware
    - Volt Typhoon
    - FIN7
    - Water Gamayun
  asset_type: Endpoint
  mitre_attack_id:
    - T1059.007
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/fin7/jssloader/sysmon.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
