name: Windows Steal Authentication Certificates Certificate Issued
id: 9b1a5385-0c31-4c39-9753-dc26b8ce64c2
version: 5
date: '2025-05-02'
author: Michael Haag, Splunk
status: production
type: Anomaly
description: The following analytic identifies the issuance of a new certificate by
  Certificate Services - AD CS, detected via Event ID 4887. This event logs the requester
  user context, DNS hostname of the requesting machine, and the request time. Monitoring
  this activity is crucial as it can indicate potential misuse of authentication certificates.
  If confirmed malicious, an attacker could use the issued certificate to impersonate
  users, escalate privileges, or maintain persistence within the environment. This
  detection helps in identifying and correlating suspicious certificate-related activities
  for further investigation.
data_source:
- Windows Event Log Security 4887
search: '`wineventlog_security`  EventCode=4887 | stats count min(_time) as firstTime
  max(_time) as lastTime by dest, name, Requester, action, Attributes, Subject | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`| `windows_steal_authentication_certificates_certificate_issued_filter`'
how_to_implement: To implement this analytic, enhanced Audit Logging must be enabled
  on AD CS and within Group Policy Management for CS server. See Page 115 of first
  reference.
known_false_positives: False positives will be generated based on normal certificates
  issued. Leave enabled to generate Risk, as this is meant to be an anomaly analytic.
references:
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A certificate was issued to $dest$.
  risk_objects:
  - field: dest
    type: system
    score: 8
  threat_objects: []
tags:
  analytic_story:
  - Windows Certificate Services
  asset_type: Endpoint
  mitre_attack_id:
  - T1649
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1649/atomic_red_team/4887_windows-security.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
