name: Windows PowerShell Process With Malicious String
id: 5df35d50-e1a3-4a52-a337-92e69d9b1b8a
version: 4
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: The following analytic detects the execution of multiple offensive toolkits
  and commands through the process execution datamodel. This method captures commands
  given directly to powershell.exe, allowing for the identification of suspicious
  activities including several well-known tools used for credential theft, lateral
  movement, and persistence. If confirmed malicious, this could lead to unauthorized
  access, privilege escalation, and potential compromise of sensitive information
  within the environment.
data_source:
- Windows Event Log Security 4688
- Sysmon EventID 1
- CrowdStrike ProcessRollup2
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes where `process_powershell` \nby\
  \ Processes.action Processes.dest Processes.original_file_name Processes.parent_process\
  \ Processes.parent_process_exec \nProcesses.parent_process_guid Processes.parent_process_id\
  \ Processes.parent_process_name \nProcesses.parent_process_path Processes.process\
  \ Processes.process_exec Processes.process_guid Processes.process_hash \nProcesses.process_id\
  \ Processes.process_integrity_level Processes.process_name Processes.process_path\
  \ \nProcesses.user Processes.user_id Processes.vendor_product \n| `drop_dm_object_name(Processes)`\
  \ \n| `security_content_ctime(firstTime)`\n| `security_content_ctime(lastTime)`\n\
  | lookup malicious_powershell_strings command as process\n| where isnotnull(match)\n\
  | `windows_powershell_process_with_malicious_string_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unknown, possible usage by internal red team or powershell
  commands with overlap.
references:
- https://attack.mitre.org/techniques/T1059/001/
- https://github.com/PowerShellMafia/PowerSploit
- https://github.com/PowerShellEmpire/
- https://github.com/S3cur3Th1sSh1t/PowerSharpPack
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search dest = "$dest$" AND user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$","$user$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: Investigate PowerShell on $dest$
  search: '| from datamodel:Endpoint.Processes | search dest=$dest|s$ process_name=$process_name$
    "*$match$*"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The user $user$ ran a known malicious PowerShell string matching *$match$*
    on $dest$
  risk_objects:
  - field: user
    type: user
    score: 70
  - field: dest
    type: system
    score: 70
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Malicious PowerShell
  asset_type: Endpoint
  mitre_attack_id:
  - T1059.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087.002/AD_discovery/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
