name: Windows WMI Impersonate Token
id: cf192860-2d94-40db-9a51-c04a2e8a8f8b
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description:
  The following analytic detects potential WMI token impersonation activities
  in a process or command. It leverages Sysmon EventCode 10 to identify instances
  where `wmiprvse.exe` has a duplicate handle or full granted access in a target process.
  This behavior is significant as it is commonly used by malware like Qakbot for privilege
  escalation or defense evasion. If confirmed malicious, this activity could allow
  an attacker to gain elevated privileges, evade defenses, and maintain persistence
  within the environment.
data_source:
  - Sysmon EventID 10
search:
  '`sysmon` EventCode=10 SourceImage = "*\\wmiprvse.exe"  GrantedAccess IN ("0x1478",
  "0x1fffff") | stats count min(_time) as firstTime max(_time) as lastTime by CallTrace
  EventID GrantedAccess Guid Opcode ProcessID SecurityID SourceImage SourceProcessGUID
  SourceProcessId TargetImage TargetProcessGUID TargetProcessId UserID dest granted_access
  parent_process_exec parent_process_guid parent_process_id parent_process_name parent_process_path
  process_exec process_guid process_id process_name process_path signature signature_id
  user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_wmi_impersonate_token_filter`'
how_to_implement:
  This search requires Sysmon Logs and a Sysmon configuration, which
  includes EventCode 10. This search uses an input macro named `sysmon`. We strongly
  recommend that you specify your environment-specific configurations (index, source,
  sourcetype, etc.) for Windows Sysmon logs. Replace the macro definition with configurations
  for your Splunk environment. The search also uses a post-filter macro designed to
  filter out known false positives.
known_false_positives:
  administrator may execute impersonate wmi object script for
  auditing. Filter is needed.
references:
  - https://github.com/trustedsec/SysmonCommunityGuide/blob/master/chapters/process-access.md
  - https://www.joesandbox.com/analysis/278341/0/html
drilldown_searches:
  - name: View the detection results for - "$dest$"
    search: '%original_detection_search% | search  dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
      starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
      values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
      as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
      as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
      | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message:
    wmiprvse.exe process having a duplicate or full Granted Access $GrantedAccess$
    to $TargetImage$ process on $dest$
  risk_objects:
    - field: dest
      type: system
      score: 25
  threat_objects: []
tags:
  analytic_story:
    - Qakbot
    - Water Gamayun
  asset_type: Endpoint
  mitre_attack_id:
    - T1047
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/wmi_impersonate/sysmon.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
