name: Windows User Discovery Via Net
id: 7742987e-88c1-476b-a626-a869e088ab72
version: 4
date: '2025-05-02'
author: Mauricio Velazco, Teoderick Contreras, Nasreddine Bencherchali, Splunk
status: production
type: Hunting
description: The following analytic detects the execution of `net.exe` or `net1.exe`
  with command-line arguments `user` or `users` to query local user accounts. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names
  and command-line executions. This activity is significant as it indicates potential
  reconnaissance efforts by adversaries to enumerate local users, which is a common
  step in situational awareness and Active Directory discovery. If confirmed malicious,
  this behavior could lead to further attacks, including privilege escalation and
  lateral movement within the network.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_net` (Processes.process="*user"
  OR Processes.process="*users" OR Processes.process="*users *" OR Processes.process="*user
  *") AND NOT (Processes.process="*/add" OR Processes.process="*/delete") by Processes.action
  Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_user_discovery_via_net_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1087/001/
tags:
  analytic_story:
  - Active Directory Discovery
  - Sandworm Tools
  - Medusa Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1087.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087.001/AD_discovery/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
