name: Windows Modify Registry Utilize ProgIDs
id: 64fa82dd-fd11-472a-9e94-c221fffa591d
version: 7
date: '2025-05-02'
author: Teoderick Contreras, Splunk
data_source:
  - Sysmon EventID 13
type: Anomaly
status: production
description:
  The following analytic detects modifications to the Windows Registry
  specifically targeting Programmatic Identifier associations to bypass User Account
  Control (UAC) Windows OS feature. ValleyRAT may create or alter registry entries
  to targetted progIDs like `.pwn` files with malicious processes, allowing it to
  execute harmful scripts or commands when these files are opened. By monitoring for
  unusual changes in registry keys linked to ProgIDs, this detection enables security
  analysts to identify potential threats like ValleyRAT execution attempts. Early
  detection of these modifications helps mitigate unauthorized execution and prevents
  further exploitation of the system.
search:
  '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE Registry.registry_path= "*\\ms-settings\\CurVer\\(Default)" by Registry.action
  Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
  Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
  Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
  | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_modify_registry_utilize_progids_filter`'
how_to_implement:
  To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the official
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: unknown
references:
  - https://www.proofpoint.com/us/blog/threat-insight/chinese-malware-appears-earnest-across-cybercrime-threat-landscape
  - https://www.fortinet.com/blog/threat-research/valleyrat-campaign-targeting-chinese-speakers
  - https://v3ded.github.io/redteam/utilizing-programmatic-identifiers-progids-for-uac-bypasses
drilldown_searches:
  - name: View the detection results for - "$user$" and "$dest$"
    search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$user$" and "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
      "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
      as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
      Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
      as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
      by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: A possible ValleyRAT Registry modification in [$dest$].
  risk_objects:
    - field: user
      type: user
      score: 49
    - field: dest
      type: system
      score: 49
  threat_objects: []
tags:
  analytic_story:
    - ValleyRAT
  asset_type: Endpoint
  mitre_attack_id:
    - T1112
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1112/pwn_reg/pwn_reg.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
