name: Windows Modify Registry DontShowUI
id: 4ff9767b-fdf2-489c-83a5-c6c34412d72e
version: 8
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
  - Sysmon EventID 13
description:
  The following analytic detects modifications to the Windows Error Reporting
  registry key "DontShowUI" to suppress error reporting dialogs. It leverages data
  from the Endpoint datamodel's Registry node to identify changes where the registry
  value is set to 0x00000001. This activity is significant as it is commonly associated
  with DarkGate malware, which uses this modification to avoid detection during its
  installation. If confirmed malicious, this behavior could allow attackers to maintain
  a low profile, avoiding user alerts and potentially enabling further malicious activities
  without user intervention.
search:
  '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path = "*\\SOFTWARE\\Microsoft\\Windows\\Windows
  Error Reporting\\DontShowUI"  Registry.registry_value_data = 0x00000001 by Registry.action
  Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
  Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
  Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
  | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_modify_registry_dontshowui_filter`'
how_to_implement:
  To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives:
  Administrators may enable or disable this feature that may
  cause some false positive, however is not common. Filter as needed.
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
drilldown_searches:
  - name: View the detection results for - "$dest$"
    search: '%original_detection_search% | search  dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
      starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
      values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
      as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
      as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
      | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: the registry for WER settings was modified to be disable show UI on $dest$.
  risk_objects:
    - field: dest
      type: system
      score: 49
  threat_objects: []
tags:
  analytic_story:
    - DarkGate Malware
  asset_type: Endpoint
  mitre_attack_id:
    - T1112
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1112/wer_dontshowui/dontshowui_sys.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
