name: Windows SOAPHound Binary Execution
id: 8e53f839-e127-4d6d-a54d-a2f67044a57f
version: 9
date: '2025-05-02'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic detects the execution of the SOAPHound binary
  (`soaphound.exe`) with specific command-line arguments. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, command-line arguments,
  and other process-related metadata. This activity is significant because SOAPHound
  is a known tool used for credential dumping and other malicious activities. If confirmed
  malicious, this behavior could allow an attacker to extract sensitive information,
  escalate privileges, or persist within the environment, posing a severe threat to
  organizational security.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name="soaphound.exe"
  OR Processes.original_file_name="soaphound.exe" AND Processes.process IN ("*--buildcache
  *", "*--bhdump *", "*--certdump *", "*--dnsdump *", "*-c *", "*--cachefilename *",
  "*-o *", "*--outputdirectory *") by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
  Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_soaphound_binary_execution_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives should be limited as the command-line arguments
  are specific to SOAPHound. Filter as needed.
references:
- https://github.com/FalconForceTeam/SOAPHound
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The process $process_name$ was executed on $dest$ related to SOAPHound.
  risk_objects:
  - field: dest
    type: system
    score: 80
  threat_objects:
  - field: process_name
    type: process
tags:
  analytic_story:
  - Windows Discovery Techniques
  - Compromised Windows Host
  asset_type: Endpoint
  atomic_guid: []
  mitre_attack_id:
  - T1069.001
  - T1069.002
  - T1087.001
  - T1087.002
  - T1482
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/soaphound/sysmon_soaphound.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
