name: Windows Process Injection With Public Source Path
id: 492f09cf-5d60-4d87-99dd-0bc325532dda
version: 9
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
description: The following analytic detects a process from a non-standard file path
  on Windows attempting to create a remote thread in another process. This is identified
  using Sysmon EventCode 8, focusing on processes not originating from typical system
  directories. This behavior is significant as it often indicates process injection,
  a technique used by adversaries to evade detection or escalate privileges. If confirmed
  malicious, this activity could allow an attacker to execute arbitrary code within
  another process, potentially leading to unauthorized actions and further compromise
  of the system.
data_source:
- Sysmon EventID 8
search: '`sysmon` EventCode=8 TargetImage = "*.exe" AND NOT(SourceImage IN("C:\\Windows\\*",
  "C:\\Program File*", "%systemroot%\\*")) | stats count min(_time) as firstTime max(_time)
  as lastTime by EventID Guid NewThreadId ProcessID SecurityID SourceImage SourceProcessGuid
  SourceProcessId StartAddress StartFunction StartModule TargetImage TargetProcessGuid
  TargetProcessId UserID dest parent_process_exec parent_process_guid parent_process_id
  parent_process_name parent_process_path process_exec process_guid process_id process_name
  process_path signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_process_injection_with_public_source_path_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts to populate the endpoint data model
  in the processes node. If you are using Sysmon, you must have at least version 6.0.4
  of the Sysmon TA.
known_false_positives: Some security products or third party applications may utilize
  CreateRemoteThread, filter as needed.
references:
- https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
tags:
  analytic_story:
  - Brute Ratel C4
  - Earth Alux
  asset_type: Endpoint
  mitre_attack_id:
  - T1055.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/create_remote_thread/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
