name: Windows Network Share Interaction Via Net
id: e51fbdb0-0be0-474f-92ea-d289f71a695e
version: 3
date: '2025-05-02'
author: Dean Luxton
status: production
type: Anomaly
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic identifies network share discovery and collection
  activities performed on Windows systems using the Net command. Attackers often use
  network share discovery to identify accessible shared resources within a network,
  which can be a precursor to privilege escalation or data exfiltration. By monitoring
  Windows Event Logs for the usage of the Net command to list and interact with network
  shares, this detection helps identify potential reconnaissance and collection activities.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes WHERE (`process_net` OR (Processes.process_name="net.exe"
  OR Processes.original_file_name="net.exe")) AND Processes.process IN ("*use *",
  "*view*") by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_network_share_interaction_via_net_filter`'
how_to_implement: The detection is based on data originating from either Endpoint
  Detection and Response (EDR) telemetry or EventCode 4688 with process command line
  logging enabled. These sources provide security-related telemetry from the endpoints.
  To implement this search, you must ingest logs that contain the process name, parent
  process, and complete command-line executions. These logs must be mapped to the
  Splunk Common Information Model (CIM) to normalize the field names capture the data
  within the datamodel schema.
known_false_positives: Administrators or power users may use this command. Additional
  filters needs to be applied.
references:
- https://attack.mitre.org/techniques/T1135/
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: User $user$ leveraged net.exe on $dest$ to interact with network shares,
    executed by parent process $parent_process$
  risk_objects:
  - field: dest
    type: system
    score: 20
  - field: user
    type: user
    score: 20
  threat_objects: []
tags:
  analytic_story:
  - Active Directory Discovery
  - Active Directory Privilege Escalation
  - Network Discovery
  asset_type: Endpoint
  atomic_guid:
  - ab39a04f-0c93-4540-9ff2-83f862c385ae
  mitre_attack_id:
  - T1135
  - T1039
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1135/net_share/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
