name: Windows InstallUtil Remote Network Connection
id: 4fbf9270-43da-11ec-9486-acde48001122
version: 16
date: '2025-09-09'
author: Michael Haag, Splunk
status: production
type: Anomaly
description:
  The following analytic detects the Windows InstallUtil.exe binary making
  a remote network connection. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and network telemetry. This activity is significant
  because InstallUtil.exe can be exploited to download and execute malicious code,
  bypassing application control mechanisms. If confirmed malicious, an attacker could
  achieve code execution, potentially leading to further system compromise, data exfiltration,
  or lateral movement within the network. Analysts should review the parent process,
  network connections, and any associated file modifications to determine the legitimacy
  of this activity.
data_source:
  - Sysmon EventID 1 AND Sysmon EventID 3
  - Cisco Network Visibility Module Flow Data
search: |
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    where `process_installutil`
    by _time span=1h
    Processes.action Processes.dest Processes.original_file_name
    Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | join process_id dest
      [| tstats `security_content_summariesonly`
          count FROM datamodel=Network_Traffic.All_Traffic where
          All_Traffic.dest_port != 0
          by All_Traffic.action All_Traffic.app All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out
          All_Traffic.dest  All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.dvc All_Traffic.protocol
          All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip All_Traffic.src_port
          All_Traffic.transport All_Traffic.user All_Traffic.vendor_product All_Traffic.direction All_Traffic.process_id
      | `drop_dm_object_name(All_Traffic)`
      | rename dest as command_and_control
      | rename src as dest]
  | table _time user src dest parent_process_name process_name process_path process process_id dest_port command_and_control
  | stats count min(_time) as firstTime
      max(_time) as lastTime
      values(process) as process
      values(command_and_control) as command_and_control
      by user dest process_name process_id dest_port parent_process_name
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_installutil_remote_network_connection_filter`
how_to_implement:
  The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives:
  Limited false positives should be present as InstallUtil is
  not typically used to download remote files. Filter as needed based on Developers
  requirements.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
drilldown_searches:
  - name: View the detection results for - "$user$" and "$dest$"
    search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$user$" and "$dest$"
    search:
      '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
      "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
      as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
      Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
      as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
      by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message:
    An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ generating a remote download.
  risk_objects:
    - field: user
      type: user
      score: 80
    - field: dest
      type: system
      score: 80
  threat_objects:
    - field: parent_process_name
      type: parent_process_name
    - field: process_name
      type: process_name
tags:
  analytic_story:
    - Living Off The Land
    - Compromised Windows Host
    - Signed Binary Proxy Execution InstallUtil
    - Cisco Network Visibility Module Analytics
  asset_type: Endpoint
  mitre_attack_id:
    - T1218.004
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test - Sysmon
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.004/atomic_red_team/windows-sysmon.log
        source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
        sourcetype: XmlWinEventLog
  - name: True Positive Test - Cisco NVM
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/cisco_network_visibility_module/cisco_nvm_flowdata/nvm_flowdata.log
        source: not_applicable
        sourcetype: cisco:nvm:flowdata
