name: Windows RDP Client Launched with Admin Session
id: 1af84ac8-05ea-4f11-8541-b2d1e45a7744
version: 2
date: '2025-08-01'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This detection identifies the execution of the Windows Remote 
  Desktop Client (mstsc.exe) with the "/v" and /admin command-line arguments. 
  The "/v" flag specifies the remote host to connect to, while the /admin flag 
  initiates a connection to the target system’s console session, often used for 
  administrative purposes. This combination may indicate that a user or attacker
  is performing privileged remote access, potentially to manage a system without
  disrupting existing user sessions. While such usage may be legitimate for IT 
  administrators, it is less common in typical user behavior. Threat actors may 
  abuse this capability during lateral movement to maintain stealthy access to 
  high-value systems. Monitoring for this pattern can help detect interactive 
  hands-on-keyboard activity, privilege abuse, or attempts to access critical 
  infrastructure without leaving typical login traces associated with non-admin 
  RDP sessions.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "mstsc.exe"
  Processes.process = "*/v:*" Processes.process = "*/admin*" by Processes.action Processes.dest
  Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_rdp_client_launched_with_admin_session_filter`'
how_to_implement: The detection is based on data that originates from Endpoint 
  Detection and Response (EDR) agents. These agents are designed to provide 
  security-related telemetry from the endpoints where the agent is installed. To
  implement this search, you must ingest logs that contain the process GUID, 
  process name, and parent process. Additionally, you must ingest complete 
  command-line executions. These logs must be processed using the appropriate 
  Splunk Technology Add-ons that are specific to the EDR product. The logs must 
  also be mapped to the `Processes` node of the `Endpoint` data model. Use the 
  Splunk Common Information Model (CIM) to normalize the field names and speed 
  up the data modeling process.
known_false_positives: False positives will be present, filter as needed or 
  restrict to critical assets on the perimeter.
references:
- https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
- https://thelocalh0st.github.io/posts/rdp/
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: a rdp client launched with admin session on $dest$.
  risk_objects:
  - field: dest
    type: system
    score: 30
  threat_objects:
  - field: parent_process_name
    type: parent_process_name
tags:
  analytic_story:
  - Windows RDP Artifacts and Defense Evasion
  asset_type: Endpoint
  mitre_attack_id:
  - T1021.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.001/mstsc_admini/mstsc_admin.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
