name: Windows BitLocker Suspicious Command Usage
id: d0e6ec70-6e40-41a2-8b93-8d9ff077a746
version: 3
date: '2025-05-02'
author: Steven Dick
status: production
type: TTP
description: This analytic is developed to detect the usage of BitLocker commands
  used to disable or impact boot settings. The malware ShrinkLocker uses various commands
  change how BitLocker handles encryption, potentially bypassing TPM requirements,
  enabling BitLocker without TPM, and enforcing specific startup key and PIN configurations.
  Such modifications can weaken system security, making it easier for unauthorized
  access and data breaches. Detecting these changes is crucial for maintaining robust
  encryption and data protection.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: "| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes \nwhere Processes.process_name =\
  \ manage-bde.exe AND Processes.process IN (\"* -protectors -disable *\",\"* -protectors\
  \ -delete *\",\"* -forcerecovery *\",\"* -lock *\") \nby Processes.action Processes.dest\
  \ Processes.original_file_name Processes.parent_process Processes.parent_process_exec\
  \ \nProcesses.parent_process_guid Processes.parent_process_id Processes.parent_process_name\
  \ \nProcesses.parent_process_path Processes.process Processes.process_exec Processes.process_guid\
  \ Processes.process_hash \nProcesses.process_id Processes.process_integrity_level\
  \ Processes.process_name Processes.process_path \nProcesses.user Processes.user_id\
  \ Processes.vendor_product \n| `drop_dm_object_name(Processes)` \n| `security_content_ctime(firstTime)`\
  \ \n| `security_content_ctime(lastTime)`\n| `windows_bitlocker_suspicious_command_usage_filter`"
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Administrators may enable or disable this feature that may
  cause some false positive.
references:
- https://attack.mitre.org/techniques/T1486/
- https://www.nccgroup.com/us/research-blog/nameless-and-shameless-ransomware-encryption-via-bitlocker/
- https://www.bitdefender.com/en-us/blog/businessinsights/shrinklocker-decryptor-from-friend-to-foe-and-back-again
- https://www.bleepingcomputer.com/news/security/new-shrinklocker-ransomware-uses-bitlocker-to-encrypt-your-files/
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$","$user$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: Investigate processes on $dest$
  search: '| from datamodel Endpoint.Processes | search process_name = $process_name$
    AND dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A suspicious Windows BitLocker command was run by $user$ detected on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 60
  - field: user
    type: user
    score: 60
  threat_objects:
  - field: parent_process
    type: process
tags:
  analytic_story:
  - ShrinkLocker
  asset_type: Endpoint
  mitre_attack_id:
  - T1486
  - T1490
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1486/bitlocker_sus_commands/bitlocker_sus_commands.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
