name: Windows Process Commandline Discovery
id: 67d2a52e-a7e2-4a5d-ae44-a21212048bc2
version: 7
date: '2025-05-19'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic detects the use of Windows Management Instrumentation
  Command-line (WMIC) to retrieve information about running processes, specifically
  targeting the command lines used to launch those processes. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on logs containing
  process details and command-line executions. This activity is significant as it
  may indicate suspicious behavior, such as a user or process gathering detailed process
  information, which is uncommon for non-technical users. If confirmed malicious,
  this could allow an attacker to gain insights into running processes, aiding in
  further exploitation or lateral movement.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_wmic` Processes.process=
  "* process *" Processes.process= "* get *" Processes.process= "*CommandLine*" by Processes.action Processes.dest
  Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_process_commandline_discovery_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators or power users may use this command for troubleshooting.
  Filter as needed.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
tags:
  analytic_story:
  - CISA AA23-347A
  asset_type: Endpoint
  mitre_attack_id:
  - T1057
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1057/process_commandline_discovery/wmic-cmdline-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
