name: Windows SQL Spawning CertUtil
id: dfc18a5a-946e-44ee-a373-c0f60d06e676
version: 11
date: '2025-05-02'
author: Michael Haag, Splunk
status: experimental
type: TTP
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic detects the use of certutil to download software,
  specifically when spawned by SQL-related processes. This detection leverages Endpoint
  Detection and Response (EDR) data, focusing on command-line executions involving
  certutil with parameters like *urlcache* and *split*. This activity is significant
  as it may indicate a compromise by threat actors, such as Flax Typhoon, who use
  certutil to establish persistent VPN connections. If confirmed malicious, this behavior
  could allow attackers to maintain access, monitor system availability, and potentially
  escalate to data theft or ransomware deployment.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("sqlservr.exe", "sqlagent.exe", "sqlps.exe", "launchpad.exe", "sqldumper.exe")
  `process_certutil` (Processes.process="*urlcache*" OR Processes.process="*verifyctl*")
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_sql_spawning_certutil_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: The occurrence of false positives should be minimal, given
  that the SQL agent does not typically download software using CertUtil.
references:
- https://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/
rba:
  message: $process_name$ was launched on $dest$ by $user$. This behavior is uncommon
    with the SQL process identified.
  risk_objects:
  - field: dest
    type: system
    score: 90
  - field: user
    type: user
    score: 90
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - SQL Server Abuse
  - Flax Typhoon
  - Storm-2460 CLFS Zero Day Exploitation
  asset_type: Endpoint
  atomic_guid: []
  mitre_attack_id:
  - T1105
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
