name: Windows LSA Secrets NoLMhash Registry
id: 48cc1605-538c-4223-8382-e36bee5b540d
version: 8
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 13
description: The following analytic detects modifications to the Windows registry
  related to the Local Security Authority (LSA) NoLMHash setting. It identifies when
  the registry value is set to 0, indicating that the system will store passwords
  in the weaker Lan Manager (LM) hash format. This detection leverages registry activity
  logs from endpoint data sources like Sysmon or EDR tools. Monitoring this activity
  is crucial as it can indicate attempts to weaken password storage security. If confirmed
  malicious, this could allow attackers to exploit weaker LM hashes, potentially leading
  to unauthorized access and credential theft.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path= "*\\System\\CurrentControlSet\\Control\\Lsa\\NoLMHash"
  Registry.registry_value_data = 0x00000000) by Registry.action Registry.dest Registry.process_guid
  Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name
  Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type
  Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
  | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_lsa_secrets_nolmhash_registry_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: Administrator may change this registry setting.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Windows LSA Secrets NoLMhash Registry on $dest$ by $user$.
  risk_objects:
  - field: dest
    type: system
    score: 64
  - field: user
    type: user
    score: 64
  threat_objects: []
tags:
  analytic_story:
  - CISA AA23-347A
  asset_type: Endpoint
  mitre_attack_id:
  - T1003.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.004/NoLMHash/lsa-reg-settings-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
