name: Windows Create Local Administrator Account Via Net
id: 2c568c34-bb57-4b43-9d75-19c605b98e70
version: 6
date: '2025-09-16'
author: Bhavin Patel, Splunk
status: production
type: Anomaly
description: The following analytic detects the creation of a local administrator
  account using the "net.exe" command. It leverages Endpoint Detection and Response
  (EDR) data to identify processes named "net.exe" with the "/add" parameter and keywords
  related to administrator accounts. This activity is significant as it may indicate
  an attacker attempting to gain persistent access or escalate privileges. If confirmed
  malicious, this could lead to unauthorized access, data theft, or further system
  compromise. Review the process details, user context, and related artifacts to determine
  the legitimacy of the activity.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes where `process_net` AND Processes.process=*/add*\
  \ AND Processes.process IN (\"*administrators*\", \"*administratoren*\", \"*administrateurs*\"\
  , \"*administrador*\", \"*amministratori*\", \"*administratorer*\", \"*Rendszergazda*\"\
  , \"*\u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\
  *\", \"*Administrat\xF6r*\") by Processes.action Processes.dest Processes.original_file_name\
  \ Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid\
  \ Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path\
  \ Processes.process Processes.process_exec Processes.process_guid Processes.process_hash\
  \ Processes.process_id Processes.process_integrity_level Processes.process_name\
  \ Processes.process_path Processes.user Processes.user_id Processes.vendor_product\
  \ | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`\
  \ | `windows_create_local_administrator_account_via_net_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators often leverage net.exe to create admin accounts.
references: []
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to add a user to the local Administrators
    group.
  risk_objects:
  - field: user
    type: user
    score: 30
  - field: dest
    type: system
    score: 30
  threat_objects:
  - field: parent_process_name
    type: parent_process_name
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - DHS Report TA18-074A
  - CISA AA22-257A
  - Medusa Ransomware
  - CISA AA24-241A
  - Azorult
  - DarkGate Malware
  - GhostRedirector IIS Module and Rungan Backdoor
  asset_type: Endpoint
  mitre_attack_id:
  - T1136.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.001/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
