name: Windows Known Abused DLL Created
id: ea91651a-772a-4b02-ac3d-985b364a5f07
version: 8
date: '2025-05-02'
author: Steven Dick
status: production
type: Anomaly
description: The following analytic identifies the creation of Dynamic Link Libraries
  (DLLs) with a known history of exploitation in atypical locations. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process and
  filesystem events. This activity is significant as it may indicate DLL search order
  hijacking or sideloading, techniques used by attackers to execute arbitrary code,
  maintain persistence, or escalate privileges. If confirmed malicious, this activity
  could allow attackers to blend in with legitimate operations, posing a severe threat
  to system integrity and security.
data_source:
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_path IN ("*\\users\\*","*\\Windows\Temp\\*","*\\programdata\\*")
  Filesystem.file_name="*.dll" by Filesystem.action Filesystem.dest Filesystem.file_access_time
  Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name
  Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid
  Filesystem.process_id Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)`
  | lookup hijacklibs_loaded library AS file_name OUTPUT islibrary, ttp, comment as
  desc | lookup hijacklibs_loaded library AS file_name excludes as file_path OUTPUT
  islibrary as excluded | search islibrary = TRUE AND excluded != TRUE | where isnotnull(file_name)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` |  `windows_known_abused_dll_created_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` and `Filesystem`
  nodes of the `Endpoint` data model. Use the Splunk Common Information Model (CIM)
  to normalize the field names and speed up the data modeling process.
known_false_positives: This analytic may flag instances where DLLs are loaded by user
  mode programs for entirely legitimate and benign purposes. It is important for users
  to be aware that false positives are not only possible but likely, and that careful
  tuning of this analytic is necessary to distinguish between malicious activity and
  normal, everyday operations of applications. This may involve adjusting thresholds,
  whitelisting known good software, or incorporating additional context from other
  security tools and logs to reduce the rate of false positives.
references:
- https://attack.mitre.org/techniques/T1574/002/
- https://hijacklibs.net/api/
- https://wietze.github.io/blog/hijacking-dlls-in-windows
- https://github.com/olafhartong/sysmon-modular/pull/195/files
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search  dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$",
    "$user$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The file [$file_name$] was written to an unusual location on [$dest$].
  risk_objects:
  - field: dest
    type: system
    score: 10
  - field: user
    type: user
    score: 10
  threat_objects:
  - field: file_name
    type: file_name
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Living Off The Land
  asset_type: Endpoint
  mitre_attack_id:
  - T1574.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.002/hijacklibs/hijacklibs_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
