name: Windows Excessive Usage Of Net App
id: 355ba810-0a20-4215-8485-9ce3f87f2e38
version: 4
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic detects excessive usage of `net.exe` within a
  one-minute interval. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names, parent processes, and command-line executions.
  This behavior is significant as it may indicate an adversary attempting to create,
  delete, or disable multiple user accounts rapidly, a tactic observed in Monero mining
  incidents. If confirmed malicious, this activity could lead to unauthorized user
  account manipulation, potentially compromising system integrity and enabling further
  malicious actions.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` values(Processes.action) as action
  values(Processes.parent_process) as parent_process values(Processes.parent_process_exec)
  as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid
  values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_path)
  as parent_process_path values(Processes.process) as process values(Processes.process_exec)
  as process_exec values(Processes.process_guid) as process_guid values(Processes.process_hash)
  as process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level)
  as process_integrity_level values(Processes.process_path) as process_path values(Processes.user)
  as user  values(Processes.user_id) as user_id values(Processes.vendor_product) as
  vendor_product count min(_time) as firstTime max(_time) as lastTime  from datamodel=Endpoint.Processes
  where `process_net` by Processes.process_name Processes.parent_process_name Processes.original_file_name
  Processes.dest Processes.user _time span=1m | where count >=10 | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_excessive_usage_of_net_app_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown. Filter as needed. Modify the time span as needed.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
drilldown_searches:
- name: View the detection results for - "$user$" and "$dest$"
  search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$" and "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
    "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
    as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
    Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: Excessive usage of net1.exe or net.exe within 1m, with command line $process$
    has been detected on $dest$ by $user$
  risk_objects:
  - field: user
    type: user
    score: 28
  - field: dest
    type: system
    score: 28
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Prestige Ransomware
  - Graceful Wipe Out Attack
  - XMRig
  - Windows Post-Exploitation
  - Azorult
  - Ransomware
  - Rhysida Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1531
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
