name: Windows System Remote Discovery With Query
id: 94859172-a521-474f-97ac-4cf4b09634a3
version: 4
date: '2025-05-02'
author: Steven Dick
status: production
type: Anomaly
description: The following analytic detects the execution of `query.exe` with command-line
  arguments aimed at discovering data on remote devices. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line
  executions. This activity is significant as adversaries may use `query.exe` to gain
  situational awareness and perform Active Directory discovery on compromised endpoints.
  If confirmed malicious, this behavior could allow attackers to identify various
  details about a system, aiding in further lateral movement and privilege escalation
  within the network.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes \nwhere (Processes.process_name=\"\
  query.exe\" OR Processes.original_file_name=\"query.exe\") AND (Processes.process=\"\
  */server*\") AND NOT Processes.process IN (\"*/server:localhost*\", \"*/server:127.0.0.1*\"\
  ) \nby Processes.action Processes.dest Processes.original_file_name Processes.parent_process\
  \ Processes.parent_process_exec \nProcesses.parent_process_guid Processes.parent_process_id\
  \ Processes.parent_process_name \nProcesses.parent_process_path Processes.process\
  \ Processes.process_exec Processes.process_guid Processes.process_hash \nProcesses.process_id\
  \ Processes.process_integrity_level Processes.process_name Processes.process_path\
  \ \nProcesses.user Processes.user_id Processes.vendor_product \n| `drop_dm_object_name(Processes)`\
  \ \n| `security_content_ctime(firstTime)` \n| `security_content_ctime(lastTime)`\
  \ \n| `windows_system_remote_discovery_with_query_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1033/
drilldown_searches:
- name: View the detection results for - "$dest$" and "$user$"
  search: '%original_detection_search% | search dest = "$dest$" user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$" and "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$","$user$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: Investigate processes on $dest$
  search: '| from datamodel:Endpoint.Processes | search dest=$dest$ process_name =
    $process_name|s$'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: The user $user$ ran the Query command to enumerate the remote system $dest$
  risk_objects:
  - field: user
    type: user
    score: 25
  - field: dest
    type: system
    score: 25
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Active Directory Discovery
  - Medusa Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1033
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1033/query_remote_usage/query_remote_usage.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
