name: Web JSP Request via URL
id: 2850c734-2d44-4431-8139-1a56f6f54c01
version: 7
date: '2025-05-02'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies URL requests associated with CVE-2022-22965
  (Spring4Shell) exploitation attempts, specifically targeting webshell access on
  a remote webserver. It detects HTTP GET requests with URLs containing ".jsp?cmd="
  or "j&cmd=" patterns. This activity is significant as it indicates potential webshell
  deployment, which can lead to unauthorized remote command execution. If confirmed
  malicious, attackers could gain control over the webserver, execute arbitrary commands,
  and potentially escalate privileges, leading to severe data breaches and system
  compromise.
data_source:
- Nginx Access
search: '| tstats count from datamodel=Web where Web.http_method IN ("GET") Web.url
  IN ("*.jsp?cmd=*","*j&cmd=*") by Web.http_user_agent Web.http_method, Web.url,Web.url_length
  Web.src, Web.dest sourcetype | `drop_dm_object_name("Web")` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `web_jsp_request_via_url_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on Web traffic that include fields relavent for traffic into the `Web` datamodel.
known_false_positives: False positives may be present with legitimate applications.
  Attempt to filter by dest IP or use Asset groups to restrict to servers.
references:
- https://www.microsoft.com/security/blog/2022/04/04/springshell-rce-vulnerability-guidance-for-protecting-against-and-detecting-cve-2022-22965/
- https://github.com/TheGejr/SpringShell
- https://www.tenable.com/blog/spring4shell-faq-spring-framework-remote-code-execution-vulnerability
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A suspicious URL has been requested against $dest$ by $src$, related to
    web shell activity.
  risk_objects:
  - field: dest
    type: system
    score: 72
  threat_objects:
  - field: src
    type: ip_address
tags:
  analytic_story:
  - Spring4Shell CVE-2022-22965
  - Earth Alux
  asset_type: Web Server
  cve:
  - CVE-2022-22965
  mitre_attack_id:
  - T1133
  - T1190
  - T1505.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: network
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/spring4shell/spring4shell_nginx.log
    source: /var/log/nginx/access.log
    sourcetype: nginx:plus:kv
