name: Detect web traffic to dynamic domain providers
id: 134da869-e264-4a8f-8d7e-fcd01c18f301
version: 6
date: '2024-11-14'
author: Bhavin Patel, Splunk
status: removed
type: TTP
description: This search looks for web connections to dynamic DNS providers.
data_source: []
search: '| tstats `security_content_summariesonly` count values(Web.url) as url min(_time)
  as firstTime from datamodel=Web where Web.status=200 by Web.src Web.dest Web.status
  | `drop_dm_object_name(Web)` | `security_content_ctime(firstTime)` | `dynamic_dns_web_traffic`
  | `detect_web_traffic_to_dynamic_domain_providers_filter`'
how_to_implement: "This search requires you to be ingesting web-traffic logs. You
  can obtain these logs from indexing data from a web proxy or by using a network-traffic-analysis
  tool, such as Bro or Splunk Stream. The web data model must contain the URL being
  requested, the IP address of the host initiating the request, and the destination
  IP. This search also leverages a lookup file, `dynamic_dns_providers_default.csv`,
  which contains a non-exhaustive list of dynamic DNS providers. Consider periodically
  updating this local lookup file with new domains.\nThis search produces fields (`isDynDNS`)
  that are not yet supported by ES Incident Review and therefore cannot be viewed
  when a finding event is raised. These fields contribute additional context to the
  finding. To see the additional metadata, add the following fields, if not already
  present, to Incident Review - Event Attributes (Configure > Incident Management
  > Incident Review Settings > Add New Entry):\n* **Label:** IsDynamicDNS, **Field:**
  isDynDNS\n Deprecated because duplicate."
known_false_positives: It is possible that list of dynamic DNS providers is outdated
  and/or that the URL being requested is legitimate.
references: []
rba:
  message: Web traffic to Dynamic DNS Provider detected
  risk_objects:
  - field: dest
    type: system
    score: 25
  threat_objects: []
tags:
  analytic_story:
  - Dynamic DNS
  asset_type: Endpoint
  mitre_attack_id:
  - T1071.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: network
