name: Domain Group Discovery With Net
id: f2f14ac7-fa81-471a-80d5-7eb65c3c7349
version: 7
date: '2025-02-10'
author: Mauricio Velazco, Splunk
status: removed
type: Hunting
description: This search has been deprecated in favour of the more generic analytic
  "c5c8e0f3-147a-43da-bf04-4cfaec27dc44". The following analytic identifies the execution
  of `net.exe` with command-line arguments used to query domain groups, specifically
  `group /domain`. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line arguments. This activity is significant
  as it indicates potential reconnaissance efforts by adversaries to enumerate domain
  groups, which is a common step in Active Directory Discovery. If confirmed malicious,
  this behavior could allow attackers to gain insights into the domain structure,
  aiding in further attacks such as privilege escalation or lateral movement.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_net` AND (Processes.process=*group*
  AND Processes.process=*/do*) by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `domain_group_discovery_with_net_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1069/002/
tags:
  analytic_story:
  - Windows Post-Exploitation
  - Active Directory Discovery
  - Prestige Ransomware
  - Graceful Wipe Out Attack
  - Rhysida Ransomware
  - Cleo File Transfer Software
  asset_type: Endpoint
  mitre_attack_id:
  - T1069.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1069.002/AD_discovery/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
