name: Reg exe used to hide files directories via registry keys
id: 61a7d1e6-f5d4-41d9-a9be-39a1ffe69459
version: 5
date: '2024-11-14'
author: Bhavin Patel, Splunk
status: removed
type: TTP
description: The search looks for command-line arguments used to hide a file or directory
  using the reg add command.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = reg.exe Processes.process="*add*" Processes.process="*Hidden*"
  Processes.process="*REG_DWORD*" by Processes.process_name Processes.parent_process_name
  Processes.dest Processes.user| `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)`| regex process = "(/d\s+2)" | `reg_exe_used_to_hide_files_directories_via_registry_keys_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: None at the moment
references: []
rba:
  message: Reg.exe used to hide a file or directory on $dest$
  risk_objects:
  - field: dest
    type: system
    score: 25
  - field: user
    type: user
    score: 25
  threat_objects: []
tags:
  asset_type: Endpoint
  analytic_story:
  - Windows Defense Evasion Tactics
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  mitre_attack_id:
  - T1564.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
