name: Windows Query Registry Reg Save
id: cbee60c1-b776-456f-83c2-faa56bdbe6c6
version: 6
date: '2025-01-24'
author: Teoderick Contreras, Splunk
status: removed
type: Hunting
description: The following analytic has been deprecated.
  The following analytic detects the execution of the reg.exe process with
  the "save" parameter. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process execution logs and command-line arguments.
  This activity is significant because threat actors often use the "reg save" command
  to dump credentials or test registry modification capabilities on compromised hosts.
  If confirmed malicious, this behavior could allow attackers to escalate privileges,
  persist in the environment, or access sensitive information stored in the registry.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where  `process_reg` AND Processes.process
  = "* save *" by Processes.process_name Processes.original_file_name Processes.process
  Processes.process_id Processes.process_guid Processes.parent_process_name Processes.parent_process
  Processes.parent_process_guid Processes.dest Processes.user | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_query_registry_reg_save_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: network administrator can use this command tool to backup registry
  before updates or modifying critical registries.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/quser
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Windows Post-Exploitation
  - CISA AA23-347A
  - Prestige Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1012
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winpeas/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
