name: Cloud Provisioning Activity From Previously Unseen IP Address
id: f86a8ec9-b042-45eb-92f4-e9ed1d781078
version: 5
date: '2025-05-02'
author: Rico Valdez, Splunk
status: production
type: Anomaly
description: The following analytic detects cloud provisioning activities originating
  from previously unseen IP addresses. It leverages cloud infrastructure logs to identify
  events where resources are created or started, and cross-references these with a
  baseline of known IP addresses. This activity is significant as it may indicate
  unauthorized access or potential misuse of cloud resources. If confirmed malicious,
  an attacker could gain unauthorized control over cloud resources, leading to data
  breaches, service disruptions, or increased operational costs.
data_source:
- AWS CloudTrail
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime, values(All_Changes.object_id)
  as object_id from datamodel=Change where (All_Changes.action=started OR All_Changes.action=created)
  All_Changes.status=success by All_Changes.src, All_Changes.user, All_Changes.command
  | `drop_dm_object_name("All_Changes")` | lookup previously_seen_cloud_provisioning_activity_sources
  src as src OUTPUT firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data
  | where enough_data=1 | eval firstTimeSeenSrc=min(firstTimeSeen) | where isnull(firstTimeSeenSrc)
  OR firstTimeSeenSrc > relative_time(now(), `previously_unseen_cloud_provisioning_activity_window`)
  | `security_content_ctime(firstTime)` | table firstTime, src, user, object_id, command
  | `cloud_provisioning_activity_from_previously_unseen_ip_address_filter`'
how_to_implement: You must be ingesting your cloud infrastructure logs from your cloud
  provider.  You should run the baseline search `Previously Seen Cloud Provisioning
  Activity Sources - Initial` to build the initial table of source IP address, geographic
  locations, and times. You must also enable the second baseline search `Previously
  Seen Cloud Provisioning Activity Sources - Update` to keep this table up to date
  and to age out old data. You can adjust the time window for this search by updating
  the `previously_unseen_cloud_provisioning_activity_window` macro. You can also provide
  additional filtering for this search by customizing the `cloud_provisioning_activity_from_previously_unseen_ip_address_filter`
  macro.
known_false_positives: "This is a strictly behavioral search, so we define \"false
  positive\" slightly differently. Every time this fires, it will accurately reflect
  the first occurrence in the time period you're searching within, plus what is stored
  in the cache feature. But while there are really no \"false positives\" in a traditional
  sense, there is definitely lots of noise.\nThis search will fire any time a new
  IP address is seen in the **GeoIP** database for any kind of provisioning activity.
  If you typically do all provisioning from tools inside of your country, there should
  be few false positives. If you are located in countries where the free version of
  **MaxMind GeoIP** that ships by default with Splunk has weak resolution (particularly
  small countries in less economically powerful regions), this may be much less valuable
  to you."
references: []
drilldown_searches:
- name: View the detection results for - "$object_id$"
  search: '%original_detection_search% | search  object_id = "$object_id$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$object_id$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$object_id$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: User $user$ is starting or creating an instance $object_id$ for the first
    time from IP address $src$
  risk_objects:
  - field: object_id
    type: system
    score: 42
  - field: user
    type: user
    score: 42
  threat_objects:
  - field: src
    type: ip_address
tags:
  analytic_story:
  - Suspicious Cloud Provisioning Activities
  asset_type: AWS Instance
  mitre_attack_id:
  - T1078
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: threat
  manual_test: This search needs the baseline to be run first to create a lookup
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
