name: O365 New Email Forwarding Rule Enabled
id: ac7c4d0a-06a3-4278-aa59-88a5e537f981
version: 7
date: '2025-05-02'
author: Mauricio Velazco, Splunk
data_source: []
type: TTP
status: production
description: The following analytic identifies the creation of new email forwarding
  rules in an Office 365 environment via the UpdateInboxRules operation. It leverages
  Office 365 management activity events to detect rules that forward emails to external
  recipients by examining the OperationProperties for specific forwarding actions.
  This activity is significant as it may indicate unauthorized email redirection,
  potentially leading to data exfiltration. If confirmed malicious, attackers could
  intercept sensitive communications, leading to data breaches and information leakage.
search: "`o365_management_activity` Workload=Exchange Operation=UpdateInboxRules 
  | eval match1=mvfind('OperationProperties{}.Value', \"ForwardToRecipientsAction\") 
  | eval match2=mvfind('OperationProperties{}.Value', \"ForwardAsAttachmentToRecipientsAction\") 
  | eval match3=mvfind('OperationProperties{}.Value', \"RedirectToRecipientsAction\") 
  | eval index = mvfind('OperationProperties{}.Name', \"ServerRule\") 
  | where match1>=0 OR match2>= 0 OR match3>= 0 
  | eval ServerRule = mvindex('OperationProperties{}.Value',index-1) 
  | spath input=ServerRule path=Actions{}.Recipients{}.Values{}.Value output=valueExtracted 
  | mvexpand valueExtracted 
  | search valueExtracted=\"*@*.*\" 
  | eval ForwardTo=if(match(valueExtracted,\"^[^@]+@[^@]+\\\\.[^@]+$\"), valueExtracted, null) 
  | dedup ForwardTo 
  | where isnotnull(ForwardTo) 
  | fillnull 
  | stats count min(_time) as firstTime max(_time) as lastTime values(Name) as Name by signature dest user src vendor_account vendor_product ForwardTo 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `o365_new_email_forwarding_rule_enabled_filter`"
how_to_implement: You must install the Splunk Microsoft Office 365 Add-on and ingest
  Office 365 management activity events.
known_false_positives: Users may create email forwarding rules for legitimate purposes.
  Filter as needed.
references:
- https://attack.mitre.org/techniques/T1114/003/
drilldown_searches:
- name: View the detection results for - "$user$"
  search: '%original_detection_search% | search  user = "$user$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$user$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: A forwarding email inbox rule was created for $user$
  risk_objects:
  - field: user
    type: user
    score: 42
  threat_objects: []
tags:
  analytic_story:
  - Office 365 Collection Techniques
  asset_type: O365 Tenant
  mitre_attack_id:
  - T1114.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: audit
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1114.003/o365_email_forwarding_rule_created/o365_email_forwarding_rule_created.log
    sourcetype: o365:management:activity
    source: o365
