name: Cisco Secure Firewall - High EVE Threat Confidence
id: 8c15183e-2e70-4db4-86c3-88f8d9129b66
version: 2
date: '2025-05-02'
author: Nasreddine Bencherchali, Splunk
status: production
type: Anomaly
description: |
  The following analytic detects connections with a high Encrypted Visibility Engine (EVE) threat confidence score, indicating potentially malicious behavior within encrypted traffic. It leverages Cisco Secure Firewall Threat Defense logs and evaluates the EVE_ThreatConfidencePct field, which reflects the system's confidence in classifying encrypted sessions as threats based on machine learning models and behavioral analysis. A score equal to or greater than 80 suggests the connection is highly likely to be associated with malware command and control (C2), remote access tools, or suspicious tunneling behavior. If confirmed malicious, this may indicate covert communication over TLS from compromised hosts.
data_source:
- Cisco Secure Firewall Threat Defense Connection Event
search: |
  `cisco_secure_firewall` EventType=ConnectionEvent EVE_ThreatConfidencePct >= 80
  | stats count min(_time) as firstTime max(_time) as lastTime
      Values(rule) as rule
      Values(url) as url
      by EVE_Process, EVE_ThreatConfidencePct, src_ip, dest, dest_port, transport, action
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___high_eve_threat_confidence_filter`
how_to_implement: |
  This search requires Cisco Secure Firewall Threat Defense Logs, which
  includes the ConnectionEvent EventType. This search uses an input macro named `cisco_secure_firewall`.
  We strongly recommend that you specify your environment-specific configurations
  (index, source, sourcetype, etc.) for Cisco Secure Firewall Threat Defense logs. Replace the macro definition
  with configurations for your Splunk environment. The search also uses a post-filter
  macro designed to filter out known false positives.
  The logs are to be ingested using the Splunk Add-on for Cisco Security Cloud (https://splunkbase.splunk.com/app/7404).
  The access policy must also enable logging.
known_false_positives: |
  Some benign applications may exhibit behaviors that resemble encrypted threat patterns, especially if they use uncommon encryption libraries or custom protocols.
  Custom-developed or internal tools may trigger high EVE confidence scores depending on how they encrypt data.
  It is recommended to validate the associated process (`EVE_Process`) and destination context, and correlate with other logs (e.g., endpoint or threat intel) before taking response action.
references:
  - https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
drilldown_searches:
- name: View the detection results for - "$src_ip$"
  search: '%original_detection_search% | search  src_ip = "$src_ip$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$src_ip$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$src_ip$") starthoursago=168  | stats count min(_time)
    as firstTime max(_time) as lastTime values(search_name) as "Search Name" values(risk_message)
    as "Risk Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
    as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
    by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: High threat confidence ($EVE_ThreatConfidencePct$%) from $EVE_Process$ on $src_ip$"
  risk_objects:
    - field: src_ip
      type: system
      score: 20
  threat_objects:
  - field: EVE_Process
    type: process_name
tags:
  analytic_story:
    - Cisco Secure Firewall Threat Defense Analytics
  asset_type: Network
  security_domain: network
  mitre_attack_id:
    - T1041
    - T1071.001
    - T1105
    - T1573.002
  product:
    - Splunk Enterprise
    - Splunk Cloud
    - Splunk Enterprise Security
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/cisco_secure_firewall_threat_defense/connection_event/connection_events.log
    source: not_applicable
    sourcetype: cisco:sfw:estreamer
