name: Rundll32 DNSQuery
id: f1483f5e-ee29-11eb-9d23-acde48001122
version: 8
date: '2025-05-02'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic detects a suspicious `rundll32.exe` process making
  HTTP connections and performing DNS queries to web domains. It leverages Sysmon
  EventCode 22 logs to identify these activities. This behavior is significant as
  it is commonly associated with IcedID malware, where `rundll32.exe` checks internet
  connectivity and communicates with C&C servers to download configurations and other
  components. If confirmed malicious, this activity could allow attackers to establish
  persistence, download additional payloads, and exfiltrate sensitive data, posing
  a severe threat to the network.
data_source:
- Sysmon EventID 22
search: '`sysmon` EventCode=22 process_name="rundll32.exe" | stats count min(_time)
  as firstTime max(_time) as lastTime by answer answer_count dvc process_exec process_guid
  process_name query query_count reply_code_id signature signature_id src user_id
  vendor_product QueryName QueryResults QueryStatus | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `rundll32_dnsquery_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and eventcode = 22 dnsquery executions from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
  Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: unknown
references:
- https://any.run/malware-trends/icedid
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: rundll32 process $process_name$ made a DNS query for $query$ from host
    $dvc$
  risk_objects:
  - field: dvc
    type: system
    score: 56
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - IcedID
  - Living Off The Land
  asset_type: Endpoint
  mitre_attack_id:
  - T1218.011
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/inf_icedid/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
