name: Suspicious Process With Discord DNS Query
id: 4d4332ae-792c-11ec-89c1-acde48001122
version: 10
date: '2025-05-02'
author: Teoderick Contreras, Mauricio Velazco, Splunk
status: production
type: Anomaly
description: The following analytic identifies a process making a DNS query to Discord,
  excluding legitimate Discord application paths. It leverages Sysmon logs with Event
  ID 22 to detect DNS queries containing "discord" in the QueryName field. This activity
  is significant because Discord can be abused by adversaries to host and download
  malicious files, as seen in the WhisperGate campaign. If confirmed malicious, this
  could indicate malware attempting to download additional payloads from Discord,
  potentially leading to further code execution and compromise of the affected system.
data_source:
- Sysmon EventID 22
search: '`sysmon` EventCode=22 QueryName IN ("*discord*") Image != "*\\AppData\\Local\\Discord\\*"
  AND Image != "*\\Program Files*" AND Image != "discord.exe" | stats count min(_time)
  as firstTime max(_time) as lastTime by answer answer_count dvc process_exec process_guid
  process_name query query_count reply_code_id signature signature_id src user_id
  vendor_product QueryName QueryResults QueryStatus | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `suspicious_process_with_discord_dns_query_filter`'
how_to_implement: his detection relies on sysmon logs with the Event ID 22, DNS Query.
known_false_positives: Noise and false positive can be seen if the following instant
  messaging is allowed to use within corporate network. In this case, a filter is
  needed.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
drilldown_searches:
- name: View the detection results for - "$dest$"
  search: '%original_detection_search% | search  dest = "$dest$"'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
- name: View risk events for the last 7 days for - "$dest$"
  search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
    starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
    values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
    as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
    as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`'
  earliest_offset: $info_min_time$
  latest_offset: $info_max_time$
rba:
  message: suspicious process $process_name$ has a dns query in $QueryName$ on $dvc$
  risk_objects:
  - field: dvc
    type: system
    score: 64
  threat_objects:
  - field: process_name
    type: process_name
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  - PXA Stealer
  - Cactus Ransomware
  asset_type: Endpoint
  mitre_attack_id:
  - T1059.005
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.005/discord_dnsquery/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
